<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on July, 31 2008 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Maxima Manual: 48. draw</title>

<meta name="description" content="Maxima Manual: 48. draw">
<meta name="keywords" content="Maxima Manual: 48. draw">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=us-ascii">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="en" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="draw"></a>
<a name="SEC196"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_47.html#SEC195" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC197" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_47.html#SEC192" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC201" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC314" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 48. draw </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC197">48.1 Introduction to draw</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC198">48.2 Functions and Variables for draw</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC199">48.3 Functions and Variables for pictures</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC200">48.4 Functions and Variables for worldmap</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>





<p><a name="Item_003a-Introduction-to-draw"></a>
</p><hr size="6">
<a name="Introduction-to-draw"></a>
<a name="SEC197"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC196" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC198" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC196" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC196" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC201" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC314" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 48.1 Introduction to draw </h2>


<p><code>draw</code> is a Maxima-Gnuplot interface.
</p>
<p>There are three main functions to be used at Maxima level: 
<code>draw2d</code>, <code>draw3d</code> and <code>draw</code>.
</p>
<p>Follow this link for more elaborated examples of this package:
</p>
<p><a href="http://www.telefonica.net/web2/biomates/maxima/gpdraw">http://www.telefonica.net/web2/biomates/maxima/gpdraw</a>
</p>
<p>You need Gnuplot 4.2 to run this program.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Plotting}
 &middot;
@ref{Category: Share packages}
 &middot;
@ref{Category: Package draw}
</p>
</div>



<p><a name="Item_003a-Functions-and-Variables-for-draw"></a>
</p><hr size="6">
<a name="Functions-and-Variables-for-draw"></a>
<a name="SEC198"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC197" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC199" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC196" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC196" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC201" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC314" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 48.2 Functions and Variables for draw </h2>




<p><a name="Item_003a-xrange"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>xrange</b>
<a name="IDX1763"></a>
</dt>
<dd><p>Default value: <code>auto</code>
</p>
<p>If <code>xrange</code> is <code>auto</code>, the range for the <var>x</var> coordinate is
computed automatically.
</p>
<p>If the user wants a specific interval for <var>x</var>, it must be given as a 
Maxima list, as in <code>xrange=[-2, 3]</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange = [-3,5],
             explicit(x^2,x,-1,1))$
</pre>
<p>See also <code>yrange</code> and <code>zrange</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-yrange"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>yrange</b>
<a name="IDX1764"></a>
</dt>
<dd><p>Default value: <code>auto</code>
</p>
<p>If <code>yrange</code> is <code>auto</code>, the range for the <var>y</var> coordinate is
computed automatically.
</p>
<p>If the user wants a specific interval for <var>y</var>, it must be given as a 
Maxima list, as in <code>yrange=[-2, 3]</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(yrange = [-2,3],
             explicit(x^2,x,-1,1),
             xrange = [-3,3])$
</pre>
<p>See also <code>xrange</code> and <code>zrange</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-zrange"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>zrange</b>
<a name="IDX1765"></a>
</dt>
<dd><p>Default value: <code>auto</code>
</p>
<p>If <code>zrange</code> is <code>auto</code>, the range for the <var>z</var> coordinate is
computed automatically.
</p>
<p>If the user wants a specific interval for <var>z</var>, it must be given as a 
Maxima list, as in <code>zrange=[-2, 3]</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(yrange = [-3,3],
             zrange = [-2,5],
             explicit(x^2+y^2,x,-1,1,y,-1,1),
             xrange = [-3,3])$
</pre>
<p>See also <code>xrange</code> and <code>yrange</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>

</dd></dl>



<p><a name="Item_003a-logx"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>logx</b>
<a name="IDX1766"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>logx</code> is <code>true</code>, the <var>x</var> axis will be drawn in the
logarithmic scale.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(log(x),x,0.01,5),
             logx = true)$
</pre>
<p>See also <code>logy</code> and <code>logz</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-logy"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>logy</b>
<a name="IDX1767"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>logy</code> is <code>true</code>, the <var>y</var> axis will be drawn in the
logarithmic scale.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(logy = true,
             explicit(exp(x),x,0,5))$
</pre>
<p>See also <code>logx</code> and <code>logz</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-logz"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>logz</b>
<a name="IDX1768"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>logz</code> is <code>true</code>, the <var>z</var> axis will be drawn in the
logarithmic scale.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(logz = true,
             explicit(exp(u^2+v^2),u,-2,2,v,-2,2))$
</pre>
<p>See also <code>logx</code> and <code>logy</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-terminal"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>terminal</b>
<a name="IDX1769"></a>
</dt>
<dd><p>Default value: <code>screen</code>
</p>
<p>Selects the terminal to be used by Gnuplot; possible values are:
<code>screen</code> (default), <code>png</code>, <code>jpg</code>, <code>eps</code>, <code>eps_color</code>,
<code>gif</code>, <code>animated_gif</code>, <code>wxt</code> and <code>aquaterm</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) /* screen terminal (default) */
      draw2d(explicit(x^2,x,-1,1))$
(%i3) /* png file */
      draw2d(terminal  = 'png,
             pic_width = 300,
             explicit(x^2,x,-1,1))$
(%i4) /* jpg file */
      draw2d(terminal   = 'jpg,
             pic_width  = 300,
             pic_height = 300,
             explicit(x^2,x,-1,1))$
(%i5) /* eps file */
      draw2d(file_name = &quot;myfile&quot;,
             explicit(x^2,x,-1,1),
             terminal  = 'eps)$
(%i6) /* wxwidgets window */
      draw2d(explicit(x^2,x,-1,1),
             terminal  = 'wxt)$
</pre>
<p>An animated gif file,
</p><pre class="example">(%i1) load(draw)$
(%i2) draw(
        delay     = 100,
        file_name = &quot;zzz&quot;,
        terminal  = 'animated_gif,
        gr2d(explicit(x^2,x,-1,1)),
        gr2d(explicit(x^3,x,-1,1)),
        gr2d(explicit(x^4,x,-1,1)));
End of animation sequence
(%o2)          [gr2d(explicit), gr2d(explicit), gr2d(explicit)]
</pre>
<p>Option <code>delay</code> is only active in animated gif's; it is ignored in
any other case.
</p>
<p>See also <code>file_name</code>, <code>pic_width</code>, <code>pic_height</code> and <code>delay</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-font"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>font</b>
<a name="IDX1770"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p>This option can be used to set the font face to be used by the terminal.
Only one font face and size can be used throughout the plot.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>See also <code>font_size</code>.
</p>
<p>Gnuplot doesn't handle fonts by itself, it leaves this task to the
support libraries of the different terminals, each one with its own
philosophy about it. A brief summary follows:
</p>
<ul>
<li>
<i>x11</i>:
Uses the normal x11 font server mechanism.

<p>Example:
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(font      = &quot;Arial&quot;, 
             font_size = 20,
             label([&quot;Arial font, size 20&quot;,1,1]))$
</pre>
</li><li>
<i>windows</i>:
The windows terminal doesn't support changing of fonts from inside the plot.
Once the plot has been generated, the font can be changed right-clicking on
the menu of the graph window.

</li><li>
<i>png, jpeg, gif</i>:
The <i>libgd</i> library uses the font path stored in the environment
variable <code>GDFONTPATH</code>; in this case, it is only necessary to
set option <code>font</code> to the font's name. It is also possible to
give the complete path to the font file.

<p>Examples:
</p>
<p>Option <code>font</code> can be given the complete path to the font file:
</p><pre class="example">(%i1) load(draw)$
(%i2) path: &quot;/usr/share/fonts/truetype/freefont/&quot; $
(%i3) file: &quot;FreeSerifBoldItalic.ttf&quot; $
(%i4) draw2d(
        font      = concat(path, file), 
        font_size = 20,
        color     = red,
        label([&quot;FreeSerifBoldItalic font, size 20&quot;,1,1]),
        terminal  = png)$
</pre>
<p>If environment variable <code>GDFONTPATH</code> is set to the
path where font files are allocated, it is possible to
set graphic option <code>font</code> to the name of the font.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(
        font      = &quot;FreeSerifBoldItalic&quot;, 
        font_size = 20,
        color     = red,
        label([&quot;FreeSerifBoldItalic font, size 20&quot;,1,1]),
        terminal  = png)$
</pre>
</li><li>
<i>Postscript</i>:
Standard Postscript fonts are: <code>&quot;Times-Roman&quot;</code>, <code>&quot;Times-Italic&quot;</code>, <code>&quot;Times-Bold&quot;</code>, <code>&quot;Times-BoldItalic&quot;</code>, <code>&quot;Helvetica&quot;</code>, <code>&quot;Helvetica-Oblique&quot;</code>, <code>&quot;Helvetica-Bold&quot;</code>, <code>&quot;Helvetic-BoldOblique&quot;</code>, <code>&quot;Courier&quot;</code>, <code>&quot;Courier-Oblique&quot;</code>, <code>&quot;Courier-Bold&quot;</code>, and <code>&quot;Courier-BoldOblique&quot;</code>.
  
<p>Example:
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(
        font      = &quot;Courier-Oblique&quot;, 
        font_size = 15,
        label([&quot;Courier-Oblique font, size 15&quot;,1,1]),
        terminal = eps)$
</pre>
</li><li>
<i>wxt</i>:
The <i>pango</i> library finds fonts via the <code>fontconfig</code> utility.

</li><li>
<i>aqua</i>:
Default is <code>&quot;Times-Roman&quot;</code>.
</li></ul>

<p>The gnuplot documentation is an important source of information about terminals and fonts.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-font_005fsize"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>font_size</b>
<a name="IDX1771"></a>
</dt>
<dd><p>Default value: 12
</p>
<p>This option can be used to set the font size to be used by the terminal.
Only one font face and size can be used throughout the plot. <code>font_size</code> is
active only when option <code>font</code> is not equal to the empty string.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>See also <code>font</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-grid"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>grid</b>
<a name="IDX1772"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>grid</code> is <code>true</code>, a grid will be drawn on the <var>xy</var> plane.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(grid = true,
             explicit(exp(u),u,-2,2))$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-title"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>title</b>
<a name="IDX1773"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p>Option <code>title</code>, a string, is the main title for the scene.
By default, no title is written.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(exp(u),u,-2,2),
             title = &quot;Exponential function&quot;)$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-xlabel"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>xlabel</b>
<a name="IDX1774"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p>Option <code>xlabel</code>, a string, is the label for the <var>x</var> axis.
By default, no label is written.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xlabel = &quot;Time&quot;,
             explicit(exp(u),u,-2,2),
             ylabel = &quot;Population&quot;)$
</pre>
<p>See also <code>ylabel</code>, and <code>zlabel</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-ylabel"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>ylabel</b>
<a name="IDX1775"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p>Option <code>ylabel</code>, a string, is the label for the <var>y</var> axis.
By default, no label is written.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xlabel = &quot;Time&quot;,
             ylabel = &quot;Population&quot;,
             explicit(exp(u),u,-2,2) )$
</pre>
<p>See also <code>xlabel</code>, and <code>zlabel</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-zlabel"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>zlabel</b>
<a name="IDX1776"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p>Option <code>zlabel</code>, a string, is the label for the <var>z</var> axis.
By default, no label is written.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(zlabel = &quot;Z variable&quot;,
             ylabel = &quot;Y variable&quot;,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2),
             xlabel = &quot;X variable&quot; )$
</pre>
<p>See also <code>xlabel</code>, and <code>ylabel</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-xtics"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>xtics</b>
<a name="IDX1777"></a>
</dt>
<dd><p>Default value: <code>auto</code>
</p>
<p>This graphic option controls the way tic marks are drawn on the <var>x</var> axis.
</p>
<ul>
<li>
When option <code>xtics</code> is bounded to symbol <var>auto</var>, tic marks are
drawn automatically.

</li><li>
When option <code>xtics</code> is bounded to symbol <var>none</var>, tic marks are
not drawn.

</li><li>
When option <code>xtics</code> is bounded to a positive number, this is the distance
between two consecutive tic marks.

</li><li>
When option <code>xtics</code> is bounded to a list of length three of the
form <code>[start,incr,end]</code>, tic marks are plotted from <code>start</code> 
to <code>end</code> at intervals of length <code>incr</code>.

</li><li>
When option <code>xtics</code> is bounded to a set of numbers of the
form <code>{n1, n2, ...}</code>, tic marks are plotted at values <code>n1</code>,
<code>n2</code>, ...

</li><li>
When option <code>xtics</code> is bounded to a set of pairs of the
form <code>{[&quot;label1&quot;, n1], [&quot;label2&quot;, n2], ...}</code>, tic marks corresponding to values <code>n1</code>,
<code>n2</code>, ... are labeled with <code>&quot;label1&quot;</code>, <code>&quot;label2&quot;</code>, ..., respectively.
</li></ul>

<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Examples:
</p>
<p>Disable tics.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xtics = 'none,
             explicit(x^3,x,-1,1)  )$
</pre>
<p>Tics every 1/4 units.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xtics = 1/4,
             explicit(x^3,x,-1,1)  )$
</pre>
<p>Tics from -3/4 to 3/4 in steps of 1/8.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xtics = [-3/4,1/8,3/4],
             explicit(x^3,x,-1,1)  )$
</pre>
<p>Tics at points -1/2, -1/4 and 3/4.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xtics = {-1/2,-1/4,3/4},
             explicit(x^3,x,-1,1)  )$
</pre>
<p>Labeled tics.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xtics = {[&quot;High&quot;,0.75],[&quot;Medium&quot;,0],[&quot;Low&quot;,-0.75]},
             explicit(x^3,x,-1,1)  )$
</pre>
<p>See also <code>ytics</code>, and <code>ztics</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-ytics"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>ytics</b>
<a name="IDX1778"></a>
</dt>
<dd><p>Default value: <code>auto</code>
</p>
<p>This graphic option controls the way tic marks are drawn on the <var>y</var> axis.
</p>
<p>See <code>xtics</code> for a complete description.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-ztics"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>ztics</b>
<a name="IDX1779"></a>
</dt>
<dd><p>Default value: <code>auto</code>
</p>
<p>This graphic option controls the way tic marks are drawn on the <var>z</var> axis.
</p>
<p>See <code>xtics</code> for a complete description.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-xtics_005frotate"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>xtics_rotate</b>
<a name="IDX1780"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>xtics_rotate</code> is <code>true</code>, tic marks on the <var>x</var> axis are rotated 
90 degrees.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-ytics_005frotate"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>ytics_rotate</b>
<a name="IDX1781"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>ytics_rotate</code> is <code>true</code>, tic marks on the <var>y</var> axis are rotated 
90 degrees.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-ztics_005frotate"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>ztics_rotate</b>
<a name="IDX1782"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>ztics_rotate</code> is <code>true</code>, tic marks on the <var>z</var> axis are rotated 
90 degrees.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-xtics_005faxis"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>xtics_axis</b>
<a name="IDX1783"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>xtics_axis</code> is <code>true</code>, tic marks and their labels are plotted just
along the <var>x</var> axis, if it is <code>false</code> tics are plotted on the border.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>

<p><a name="Item_003a-ytics_005faxis"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>ytics_axis</b>
<a name="IDX1784"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>ytics_axis</code> is <code>true</code>, tic marks and their labels are plotted just
along the <var>y</var> axis, if it is <code>false</code> tics are plotted on the border.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>

<p><a name="Item_003a-ztics_005faxis"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>ztics_axis</b>
<a name="IDX1785"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>ztics_axis</code> is <code>true</code>, tic marks and their labels are plotted just
along the <var>z</var> axis, if it is <code>false</code> tics are plotted on the border.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-xaxis"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>xaxis</b>
<a name="IDX1786"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>xaxis</code> is <code>true</code>, the <var>x</var> axis is drawn.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             xaxis       = true,
             xaxis_color = blue)$
</pre>
<p>See also <code>xaxis_width</code>, <code>xaxis_type</code> and <code>xaxis_color</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-xaxis_005fwidth"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>xaxis_width</b>
<a name="IDX1787"></a>
</dt>
<dd><p>Default value: 1
</p>
<p><code>xaxis_width</code> is the width of the <var>x</var> axis.
Its value must be a positive number.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             xaxis       = true,
             xaxis_width = 3)$
</pre>
<p>See also <code>xaxis</code>, <code>xaxis_type</code> and <code>xaxis_color</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-xaxis_005ftype"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>xaxis_type</b>
<a name="IDX1788"></a>
</dt>
<dd><p>Default value: <code>dots</code>
</p>
<p><code>xaxis_type</code> indicates how the <var>x</var> axis is displayed; 
possible values are <code>solid</code> and <code>dots</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             xaxis       = true,
             xaxis_type  = solid)$
</pre>
<p>See also <code>xaxis</code>, <code>xaxis_width</code> and <code>xaxis_color</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-xaxis_005fcolor"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>xaxis_color</b>
<a name="IDX1789"></a>
</dt>
<dd><p>Default value: <code>&quot;black&quot;</code>
</p>
<p><code>xaxis_color</code> specifies the color for the <var>x</var> axis. See
<code>color</code> to know how colors are defined.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             xaxis       = true,
             xaxis_color = red)$
</pre>
<p>See also <code>xaxis</code>, <code>xaxis_width</code> and <code>xaxis_type</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-yaxis"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>yaxis</b>
<a name="IDX1790"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>yaxis</code> is <code>true</code>, the <var>y</var> axis is drawn.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             yaxis       = true,
             yaxis_color = blue)$
</pre>
<p>See also <code>yaxis_width</code>, <code>yaxis_type</code> and <code>yaxis_color</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-yaxis_005fwidth"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>yaxis_width</b>
<a name="IDX1791"></a>
</dt>
<dd><p>Default value: 1
</p>
<p><code>yaxis_width</code> is the width of the <var>y</var> axis.
Its value must be a positive number.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             yaxis       = true,
             yaxis_width = 3)$
</pre>
<p>See also <code>yaxis</code>, <code>yaxis_type</code> and <code>yaxis_color</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-yaxis_005ftype"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>yaxis_type</b>
<a name="IDX1792"></a>
</dt>
<dd><p>Default value: <code>dots</code>
</p>
<p><code>yaxis_type</code> indicates how the <var>y</var> axis is displayed; 
possible values are <code>solid</code> and <code>dots</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             yaxis       = true,
             yaxis_type  = solid)$
</pre>
<p>See also <code>yaxis</code>, <code>yaxis_width</code> and <code>yaxis_color</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-yaxis_005fcolor"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>yaxis_color</b>
<a name="IDX1793"></a>
</dt>
<dd><p>Default value: <code>&quot;black&quot;</code>
</p>
<p><code>yaxis_color</code> specifies the color for the <var>y</var> axis. See
<code>color</code> to know how colors are defined.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             yaxis       = true,
             yaxis_color = red)$
</pre>
<p>See also <code>yaxis</code>, <code>yaxis_width</code> and <code>yaxis_type</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-zaxis"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>zaxis</b>
<a name="IDX1794"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>zaxis</code> is <code>true</code>, the <var>z</var> axis is drawn in 3D plots.
This option has no effect in 2D scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1),
             zaxis       = true,
             zaxis_type  = solid,
             zaxis_color = blue)$
</pre>
<p>See also <code>zaxis_width</code>, <code>zaxis_type</code> and <code>zaxis_color</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-zaxis_005fwidth"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>zaxis_width</b>
<a name="IDX1795"></a>
</dt>
<dd><p>Default value: 1
</p>
<p><code>zaxis_width</code> is the width of the <var>z</var> axis.
Its value must be a positive number. This option has no effect in 2D scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1),
             zaxis       = true,
             zaxis_type  = solid,
             zaxis_width = 3)$
</pre>
<p>See also <code>zaxis</code>, <code>zaxis_type</code> and <code>zaxis_color</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-zaxis_005ftype"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>zaxis_type</b>
<a name="IDX1796"></a>
</dt>
<dd><p>Default value: <code>dots</code>
</p>
<p><code>zaxis_type</code> indicates how the <var>z</var> axis is displayed; 
possible values are <code>solid</code> and <code>dots</code>.
This option has no effect in 2D scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1),
             zaxis       = true,
             zaxis_type  = solid)$
</pre>
<p>See also <code>zaxis</code>, <code>zaxis_width</code> and <code>zaxis_color</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-zaxis_005fcolor"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>zaxis_color</b>
<a name="IDX1797"></a>
</dt>
<dd><p>Default value: <code>&quot;black&quot;</code>
</p>
<p><code>zaxis_color</code> specifies the color for the <var>z</var> axis. See
<code>color</code> to know how colors are defined. 
This option has no effect in 2D scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1),
             zaxis       = true,
             zaxis_type  = solid,
             zaxis_color = red)$
</pre>
<p>See also <code>zaxis</code>, <code>zaxis_width</code> and <code>zaxis_type</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-xyplane"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>xyplane</b>
<a name="IDX1798"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>Allocates the xy-plane in 3D scenes. When <code>xyplane</code> is
<code>false</code>, the xy-plane is placed automatically; when it is
a real number, the xy-plane intersects the z-axis at this level.
This option has no effect in 2D scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(xyplane = %e-2,
             explicit(x^2+y^2,x,-1,1,y,-1,1))$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-rot_005fvertical"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>rot_vertical</b>
<a name="IDX1799"></a>
</dt>
<dd><p>Default value: 60
</p>
<p><code>rot_vertical</code> is the angle (in degrees) of vertical rotation (around 
the <var>x</var> axis) to set the view point in 3d scenes.
</p>
<p>The angle is bounded to the <em>[0, 180]</em> interval.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(rot_vertical = 170,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre>
<p>See also <code>rot_horizontal</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-rot_005fhorizontal"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>rot_horizontal</b>
<a name="IDX1800"></a>
</dt>
<dd><p>Default value: 30
</p>
<p><code>rot_horizontal</code> is the angle (in degrees) of horizontal rotation (around 
the <var>z</var> axis) to set the view point in 3d scenes.
</p>
<p>The angle is bounded to the <em>[0, 360]</em> interval.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(rot_vertical = 170,
             rot_horizontal = 360,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre>
<p>See also <code>rot_vertical</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-xy_005ffile"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>xy_file</b>
<a name="IDX1801"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p><code>xy_file</code> is the name of the file where the coordinates will be saved
after clicking with the mouse button and hitting the 'x' key. By default,
no coordinates are saved.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-user_005fpreamble"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>user_preamble</b>
<a name="IDX1802"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p>Expert Gnuplot users can make use of this option to fine tune Gnuplot's
behaviour by writing settings to be sent before the <code>plot</code> or <code>splot</code>
command.
</p>
<p>The value of this option must be a string or a list of strings (one per line).
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<p>The <i>dumb</i> terminal is not supported by package <code>draw</code>,
but it is possible to set it by making use of option <code>user_preamble</code>,
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(exp(x)-1,x,-1,1),
             parametric(cos(u),sin(u),u,0,2*%pi),
             user_preamble=&quot;set terminal dumb&quot;)$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-file_005fname"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>file_name</b>
<a name="IDX1803"></a>
</dt>
<dd><p>Default value: <code>&quot;maxima_out&quot;</code>
</p>
<p>This is the name of the file where terminals <code>png</code>, <code>jpg</code>, <code>eps</code>
and <code>eps_color</code> will save the graphic.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(file_name = &quot;myfile&quot;,
             explicit(x^2,x,-1,1),
             terminal  = 'png)$
</pre>
<p>See also <code>terminal</code>, <code>pic_width</code>, and <code>pic_height</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>

<p><a name="Item_003a-delay"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>delay</b>
<a name="IDX1804"></a>
</dt>
<dd><p>Default value: 5
</p>
<p>This is the delay in 1/100 seconds of frames in animated gif files.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw(
        delay     = 100,
        file_name = &quot;zzz&quot;,
        terminal  = 'animated_gif,
        gr2d(explicit(x^2,x,-1,1)),
        gr2d(explicit(x^3,x,-1,1)),
        gr2d(explicit(x^4,x,-1,1)));
End of animation sequence
(%o2)          [gr2d(explicit), gr2d(explicit), gr2d(explicit)]
</pre>
<p>Option <code>delay</code> is only active in animated gif's; it is ignored in
any other case.
</p>
<p>See also <code>terminal</code>, <code>pic_width</code>, and <code>pic_height</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>

<p><a name="Item_003a-pic_005fwidth"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>pic_width</b>
<a name="IDX1805"></a>
</dt>
<dd><p>Default value: 640
</p>
<p>This is the width of the bitmap file generated by terminals <code>png</code> and <code>jpg</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'png,
             pic_width  = 300,
             pic_height = 300,
             explicit(x^2,x,-1,1))$
</pre>
<p>See also <code>terminal</code>, <code>file_name</code>, and <code>pic_height</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-pic_005fheight"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>pic_height</b>
<a name="IDX1806"></a>
</dt>
<dd><p>Default value: 640
</p>
<p>This is the height of the bitmap file generated by terminals <code>png</code> and <code>jpg</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'png,
             pic_width  = 300,
             pic_height = 300,
             explicit(x^2,x,-1,1))$
</pre>
<p>See also <code>terminal</code>, <code>file_name</code>, and <code>pic_width</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-eps_005fwidth"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>eps_width</b>
<a name="IDX1807"></a>
</dt>
<dd><p>Default value: 12
</p>
<p>This is the width (measured in cm) of the Postscipt file
generated by terminals <code>eps</code> and <code>eps_color</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'eps,
             eps_width  = 3,
             eps_height = 3,
             explicit(x^2,x,-1,1))$
</pre>
<p>See also <code>terminal</code>, <code>file_name</code>, and <code>eps_height</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-eps_005fheight"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>eps_height</b>
<a name="IDX1808"></a>
</dt>
<dd><p>Default value: 8
</p>
<p>This is the height (measured in cm) of the Postscipt file
generated by terminals <code>eps</code> and <code>eps_color</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'eps,
             eps_width  = 3,
             eps_height = 3,
             explicit(x^2,x,-1,1))$
</pre>
<p>See also <code>terminal</code>, <code>file_name</code>, and <code>eps_width</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-axis_005fbottom"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>axis_bottom</b>
<a name="IDX1809"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>axis_bottom</code> is <code>true</code>, the bottom axis is shown in 2d scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_bottom = false,
             explicit(x^3,x,-1,1))$
</pre>
<p>See also <code>axis_left</code>,  <code>axis_top</code>, <code>axis_right</code>, and <code>axis_3d</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-axis_005fleft"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>axis_left</b>
<a name="IDX1810"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>axis_left</code> is <code>true</code>, the left axis is shown in 2d scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_left = false,
             explicit(x^3,x,-1,1))$
</pre>
<p>See also <code>axis_bottom</code>,  <code>axis_top</code>, <code>axis_right</code>, and <code>axis_3d</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-axis_005ftop"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>axis_top</b>
<a name="IDX1811"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>axis_top</code> is <code>true</code>, the top axis is shown in 2d scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_top = false,
             explicit(x^3,x,-1,1))$
</pre>
<p>See also <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_right</code>, and <code>axis_3d</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-axis_005fright"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>axis_right</b>
<a name="IDX1812"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>axis_right</code> is <code>true</code>, the right axis is shown in 2d scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_right = false,
             explicit(x^3,x,-1,1))$
</pre>
<p>See also <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_top</code>, and <code>axis_3d</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-axis_005f3d"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>axis_3d</b>
<a name="IDX1813"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>axis_3d</code> is <code>true</code>, the <var>x</var>, <var>y</var> and <var>z</var> axis are shown in 3d scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(axis_3d = false,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre>
<p>See also <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_top</code>, and <code>axis_right</code> for axis in 2d.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>





<p><a name="Item_003a-palette"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>palette</b>
<a name="IDX1814"></a>
</dt>
<dd><p>Default value: <code>color</code>
</p>
<p><code>palette</code> indicates how to map the real values of a matrix
passed to object <code>image</code> onto color components.
</p>
<p><code>palette</code> is a vector of length three with components 
ranging from -36 to +36; each value is an index for a formula mapping the levels
onto red, green and blue colors, respectively:
</p><pre class="example"> 0: 0               1: 0.5           2: 1
 3: x               4: x^2           5: x^3
 6: x^4             7: sqrt(x)       8: sqrt(sqrt(x))
 9: sin(90x)       10: cos(90x)     11: |x-0.5|
12: (2x-1)^2       13: sin(180x)    14: |cos(180x)|
15: sin(360x)      16: cos(360x)    17: |sin(360x)|
18: |cos(360x)|    19: |sin(720x)|  20: |cos(720x)|
21: 3x             22: 3x-1         23: 3x-2
24: |3x-1|         25: |3x-2|       26: (3x-1)/2
27: (3x-2)/2       28: |(3x-1)/2|   29: |(3x-2)/2|
30: x/0.32-0.78125 31: 2*x-0.84     32: 4x;1;-2x+1.84;x/0.08-11.5
33: |2*x - 0.5|    34: 2*x          35: 2*x - 0.5
36: 2*x - 1
</pre><p>negative numbers mean negative colour component.
</p>
<p><code>palette = gray</code> and <code>palette = color</code> are short cuts for
<code>palette = [3,3,3]</code> and <code>palette = [7,5,15]</code>, respectively.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) im: apply(
           'matrix,
            makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) /* palette = color, default */
      draw2d(image(im,0,0,30,30))$
(%i4) draw2d(palette = gray, image(im,0,0,30,30))$
(%i5) draw2d(palette = [15,20,-4],
             colorbox=false,
             image(im,0,0,30,30))$
</pre>
<p>See also <code>colorbox</code>. 
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>




<p><a name="Item_003a-colorbox"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>colorbox</b>
<a name="IDX1815"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>colorbox</code> is <code>true</code>, a color scale is drawn together with
<code>image</code> objects.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) im: apply('matrix,
                 makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) draw2d(image(im,0,0,30,30))$
(%i4) draw2d(colorbox=false, image(im,0,0,30,30))$
</pre>
<p>See also <code>palette</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-enhanced3d"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>enhanced3d</b>
<a name="IDX1816"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>enhanced3d</code> is <code>true</code>, surfaces are colored in 3d plots;
in other words, it sets Gnuplot's pm3d mode.
</p>
<p>See option <code>palette</code> to learn how palettes are specified.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(surface_hide = true,
             enhanced3d   = true,
             palette      = gray,
             explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3))$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-point_005fsize"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>point_size</b>
<a name="IDX1817"></a>
</dt>
<dd><p>Default value: 1
</p>
<p><code>point_size</code> sets the size for plotted points. It must be a
non negative number.
</p>
<p>This option has no effect when graphic option <code>point_type</code> is
set to <code>dot</code>.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>.

</li><li>
<code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(points(makelist([random(20),random(50)],k,1,10)),
        point_size = 5,
        points(makelist(k,k,1,20),makelist(random(30),k,1,20)))$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-point_005ftype"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>point_type</b>
<a name="IDX1818"></a>
</dt>
<dd><p>Default value: 1
</p>
<p><code>point_type</code> indicates how isolated points are displayed; the value of this
option can be any integer index greater or equal than -1, or the name of
a point style: <code>$none</code> (-1), <code>dot</code> (0), <code>plus</code> (1), <code>multiply</code> (2),
<code>asterisk</code> (3), <code>square</code> (4), <code>filled_square</code> (5), <code>circle</code> (6),
<code>filled_circle</code> (7), <code>up_triangle</code> (8), <code>filled_up_triangle</code> (9),
<code>down_triangle</code> (10), <code>filled_down_triangle</code> (11), <code>diamant</code> (12) and
<code>filled_diamant</code> (13).
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>.

</li><li>
<code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange = [0,10],
             yrange = [0,10],
             point_size = 3,
             point_type = diamant,
             points([[1,1],[5,1],[9,1]]),
             point_type = filled_down_triangle,
             points([[1,2],[5,2],[9,2]]),
             point_type = asterisk,
             points([[1,3],[5,3],[9,3]]),
             point_type = filled_diamant,
             points([[1,4],[5,4],[9,4]]),
             point_type = 5,
             points([[1,5],[5,5],[9,5]]),
             point_type = 6,
             points([[1,6],[5,6],[9,6]]),
             point_type = filled_circle,
             points([[1,7],[5,7],[9,7]]),
             point_type = 8,
             points([[1,8],[5,8],[9,8]]),
             point_type = filled_diamant,
             points([[1,9],[5,9],[9,9]]) )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-points_005fjoined"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>points_joined</b>
<a name="IDX1819"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>When <code>points_joined</code> is <code>true</code>, points are joined by lines; when <code>false</code>,
isolated points are drawn. A third possible value for this graphic option is 
<code>impulses</code>; in such case, vertical segments are drawn from points to the x-axis (2D)
or to the xy-plane (3D).
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>.

</li><li>
<code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange        = [0,10],
             yrange        = [0,4],
             point_size    = 3,
             point_type    = up_triangle,
             color         = blue,
             points([[1,1],[5,1],[9,1]]),
             points_joined = true,
             point_type    = square,
             line_type     = dots,
             points([[1,2],[5,2],[9,2]]),
             point_type    = circle,
             color         = red,
             line_width    = 7,
             points([[1,3],[5,3],[9,3]]) )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-filled_005ffunc"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>filled_func</b>
<a name="IDX1820"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>Option <code>filled_func</code> controls how regions limited by functions
should be filled. When <code>filled_func</code> is <code>true</code>, the region
bounded by the function defined with object <code>explicit</code> and the
bottom of the graphic window is filled with <code>fill_color</code>. When 
<code>filled_func</code> contains a function expression, then the region bounded
by this function and the function defined with object <code>explicit</code> 
will be filled. By default, explicit functions are not filled. 
</p>
<p>This option affects only the 2d graphic object <code>explicit</code>.
</p>
<p>Example:
</p>
<p>Region bounded by an <code>explicit</code> object and the bottom of the
graphic window.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(fill_color  = red,
             filled_func = true,
             explicit(sin(x),x,0,10) )$
</pre>
<p>Region bounded by an <code>explicit</code> object and the function
defined by option <code>filled_func</code>. Note that the variable in
<code>filled_func</code> must be the same as that used in <code>explicit</code>.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(fill_color  = grey,
             filled_func = sin(x),
             explicit(-sin(x),x,0,%pi));
</pre>
<p>See also <code>fill_color</code> and <code>explicit</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-transparent"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>transparent</b>
<a name="IDX1821"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>transparent</code> is <code>true</code>, interior regions of polygons are 
filled according to <code>fill_color</code>.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>polygon</code>, <code>rectangle</code>, and <code>ellipse</code>.
</li></ul>

<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(polygon([[3,2],[7,2],[5,5]]),
             transparent = true,
             color       = blue,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-border"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>border</b>
<a name="IDX1822"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>border</code> is <code>true</code>, borders of polygons are painted
according to <code>line_type</code> and <code>line_width</code>.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>polygon</code>, <code>rectangle</code>, and <code>ellipse</code>.
</li></ul>

<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(color       = brown,
             line_width  = 8,
             polygon([[3,2],[7,2],[5,5]]),
             border      = false,
             fill_color  = blue,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-head_005fboth"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>head_both</b>
<a name="IDX1823"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>head_both</code> is <code>true</code>, vectors are plotted with two arrow heads.
If <code>false</code>, only one arrow is plotted.
</p>
<p>This option is relevant only for <code>vector</code> objects.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,8],
             yrange      = [0,8],
             head_length = 0.7,
             vector([1,1],[6,0]),
             head_both   = true,
             vector([1,7],[6,0]) )$
</pre>
<p>See also <code>head_length</code>, <code>head_angle</code>, and <code>head_type</code>. 
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-head_005flength"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>head_length</b>
<a name="IDX1824"></a>
</dt>
<dd><p>Default value: 2
</p>
<p><code>head_length</code> indicates, in <var>x</var>-axis units, the length of arrow heads.
</p>
<p>This option is relevant only for <code>vector</code> objects.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,8],
             vector([0,1],[5,5]),
             head_length = 1,
             vector([2,1],[5,5]),
             head_length = 0.5,
             vector([4,1],[5,5]),
             head_length = 0.25,
             vector([6,1],[5,5]))$
</pre>
<p>See also <code>head_both</code>, <code>head_angle</code>, and <code>head_type</code>. 
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-head_005fangle"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>head_angle</b>
<a name="IDX1825"></a>
</dt>
<dd><p>Default value: 45
</p>
<p><code>head_angle</code> indicates the angle, in degrees, between the arrow heads and
the segment.
</p>
<p>This option is relevant only for <code>vector</code> objects.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,10],
             yrange      = [0,9],
             head_length = 0.7,
             head_angle  = 10,
             vector([1,1],[0,6]),
             head_angle  = 20,
             vector([2,1],[0,6]),
             head_angle  = 30,
             vector([3,1],[0,6]),
             head_angle  = 40,
             vector([4,1],[0,6]),
             head_angle  = 60,
             vector([5,1],[0,6]),
             head_angle  = 90,
             vector([6,1],[0,6]),
             head_angle  = 120,
             vector([7,1],[0,6]),
             head_angle  = 160,
             vector([8,1],[0,6]),
             head_angle  = 180,
             vector([9,1],[0,6]) )$
</pre>
<p>See also <code>head_both</code>, <code>head_length</code>, and <code>head_type</code>. 
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-head_005ftype"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>head_type</b>
<a name="IDX1826"></a>
</dt>
<dd><p>Default value: <code>filled</code>
</p>
<p><code>head_type</code> is used to specify how arrow heads are plotted. Possible
values are: <code>filled</code> (closed and filled arrow heads), <code>empty</code>
(closed but not filled arrow heads), and <code>nofilled</code> (open arrow heads).
</p>
<p>This option is relevant only for <code>vector</code> objects.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,10],
             head_length = 1,
             vector([0,1],[5,5]), /* default type */
             head_type = 'empty,
             vector([3,1],[5,5]),
             head_type = 'nofilled,
             vector([6,1],[5,5]))$
</pre>
<p>See also <code>head_both</code>, <code>head_angle</code>, and <code>head_length</code>. 
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-unit_005fvectors"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>unit_vectors</b>
<a name="IDX1827"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>unit_vectors</code> is <code>true</code>, vectors are plotted with module 1.
This is useful for plotting vector fields. If <code>unit_vectors</code> is <code>false</code>,
vectors are plotted with its original length.
</p>
<p>This option is relevant only for <code>vector</code> objects.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [-1,6],
             yrange      = [-1,6],
             head_length = 0.1,
             vector([0,0],[5,2]),
             unit_vectors = true,
             color        = red,
             vector([0,3],[5,2]))$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-label_005falignment"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>label_alignment</b>
<a name="IDX1828"></a>
</dt>
<dd><p>Default value: <code>center</code>
</p>
<p><code>label_alignment</code> is used to specify where to write labels with
respect to the given coordinates. Possible values are: <code>center</code>,
<code>left</code>, and <code>right</code>.
</p>
<p>This option is relevant only for <code>label</code> objects.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange          = [0,10],
             yrange          = [0,10],
             points_joined   = true,
             points([[5,0],[5,10]]),
             color           = blue,
             label([&quot;Centered alignment (default)&quot;,5,2]),
             label_alignment = 'left,
             label([&quot;Left alignment&quot;,5,5]),
             label_alignment = 'right,
             label([&quot;Right alignment&quot;,5,8]))$
</pre>
<p>See also <code>label_orientation</code>, and <code>color</code>. 
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-label_005forientation"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>label_orientation</b>
<a name="IDX1829"></a>
</dt>
<dd><p>Default value: <code>horizontal</code>
</p>
<p><code>label_orientation</code> is used to specify orientation of labels.
Possible values are: <code>horizontal</code>, and <code>vertical</code>.
</p>
<p>This option is relevant only for <code>label</code> objects.
</p>
<p>Example:
</p>
<p>In this example, a dummy point is added to get an image.
Package <code>draw</code> needs always data to draw an scene.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange     = [0,10],
             yrange     = [0,10],
             point_size = 0,
             points([[5,5]]),
             color      = navy,
             label([&quot;Horizontal orientation (default)&quot;,5,2]),
             label_orientation = 'vertical,
             color             = &quot;#654321&quot;,
             label([&quot;Vertical orientation&quot;,1,5]))$
</pre>
<p>See also <code>label_alignment</code> and <code>color</code>. 
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-color"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>color</b>
<a name="IDX1830"></a>
</dt>
<dd><p>Default value: <code>&quot;black&quot;</code>
</p>
<p><code>color</code> specifies the color for plotting lines, points, borders of
polygons and labels.
</p>
<p>Colors can be given as names or in hexadecimal <i>rgb</i> code.
</p>
<p>Available color names are: 
<code>&quot;white&quot;</code>, <code>&quot;black&quot;</code>, <code>&quot;gray0&quot;</code>, <code>&quot;grey0&quot;</code>, <code>&quot;gray10&quot;</code>,
<code>&quot;grey10&quot;</code>, <code>&quot;gray20&quot;</code>, <code>&quot;grey20&quot;</code>, <code>&quot;gray30&quot;</code>, <code>&quot;grey30&quot;</code>,
<code>&quot;gray40&quot;</code>, <code>&quot;grey40&quot;</code>, <code>&quot;gray50&quot;</code>, <code>&quot;grey50&quot;</code>, <code>&quot;gray60&quot;</code>,
<code>&quot;grey60&quot;</code>, <code>&quot;gray70&quot;</code>, <code>&quot;grey70&quot;</code>, <code>&quot;gray80&quot;</code>, <code>&quot;grey80&quot;</code>,
<code>&quot;gray90&quot;</code>, <code>&quot;grey90&quot;</code>, <code>&quot;gray100&quot;</code>, <code>&quot;grey100&quot;</code>, <code>&quot;gray&quot;</code>,
<code>&quot;grey&quot;</code>, <code>&quot;light-gray&quot;</code>, <code>&quot;light-grey&quot;</code>, <code>&quot;dark-gray&quot;</code>,
<code>&quot;dark-grey&quot;</code>, <code>&quot;red&quot;</code>, <code>&quot;light-red&quot;</code>, <code>&quot;dark-red&quot;</code>, <code>&quot;yellow&quot;</code>,
<code>&quot;light-yellow&quot;</code>, <code>&quot;dark-yellow&quot;</code>, <code>&quot;green&quot;</code>, <code>&quot;light-green&quot;</code>,
<code>&quot;dark-green&quot;</code>, <code>&quot;spring-green&quot;</code>, <code>&quot;forest-green&quot;</code>, <code>&quot;sea-green&quot;</code>,
<code>&quot;blue&quot;</code>, <code>&quot;light-blue&quot;</code>, <code>&quot;dark-blue&quot;</code>, <code>&quot;midnight-blue&quot;</code>, 
<code>&quot;navy&quot;</code>, <code>&quot;medium-blue&quot;</code>, <code>&quot;royalblue&quot;</code>, <code>&quot;skyblue&quot;</code>, 
<code>&quot;cyan&quot;</code>, <code>&quot;light-cyan&quot;</code>, <code>&quot;dark-cyan&quot;</code>, <code>&quot;magenta&quot;</code>, 
<code>&quot;light-magenta&quot;</code>, <code>&quot;dark-magenta&quot;</code>, <code>&quot;turquoise&quot;</code>, 
<code>&quot;light-turquoise&quot;</code>, <code>&quot;dark-turquoise&quot;</code>, <code>&quot;pink&quot;</code>, <code>&quot;light-pink&quot;</code>,
<code>&quot;dark-pink&quot;</code>, <code>&quot;coral&quot;</code>, <code>&quot;light-coral&quot;</code>, <code>&quot;orange-red&quot;</code>,
<code>&quot;salmon&quot;</code>, <code>&quot;light-salmon&quot;</code>, <code>&quot;dark-salmon&quot;</code>, <code>&quot;aquamarine&quot;</code>,
<code>&quot;khaki&quot;</code>, <code>&quot;dark-khaki&quot;</code>, <code>&quot;goldenrod&quot;</code>, <code>&quot;light-goldenrod&quot;</code>,
<code>&quot;dark-goldenrod&quot;</code>, <code>&quot;gold&quot;</code>, <code>&quot;beige&quot;</code>, <code>&quot;brown&quot;</code>, <code>&quot;orange&quot;</code>,
<code>&quot;dark-orange&quot;</code>, <code>&quot;violet&quot;</code>, <code>&quot;dark-violet&quot;</code>, <code>&quot;plum&quot;</code> and <code>&quot;purple&quot;</code>.
</p>
<p>Cromatic componentes in hexadecimal code are introduced in the form <code>&quot;#rrggbb&quot;</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^2,x,-1,1), /* default is black */
             color = &quot;red&quot;,
             explicit(0.5 + x^2,x,-1,1),
             color = blue,
             explicit(1 + x^2,x,-1,1),
             color = &quot;light-blue&quot;, /* double quotes if - is used */
             explicit(1.5 + x^2,x,-1,1),
             color = &quot;#23ab0f&quot;,
             label([&quot;This is a label&quot;,0,1.2])  )$
</pre>
<p>See also <code>fill_color</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-fill_005fcolor"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>fill_color</b>
<a name="IDX1831"></a>
</dt>
<dd><p>Default value: <code>&quot;red&quot;</code>
</p>
<p><code>fill_color</code> specifies the color for filling polygons and
2d <code>explicit</code> functions.
</p>
<p>See <code>color</code> to learn how colors are specified.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-fill_005fdensity"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>fill_density</b>
<a name="IDX1832"></a>
</dt>
<dd><p>Default value: 0
</p>
<p><code>fill_density</code> is a number between 0 and 1 that specifies
the intensity of the <code>fill_color</code> in <code>bars</code> objects.
</p>
<p>See <code>bars</code> for examples.
</p></dd></dl>



<p><a name="Item_003a-line_005fwidth"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>line_width</b>
<a name="IDX1833"></a>
</dt>
<dd><p>Default value: 1
</p>
<p><code>line_width</code> is the width of plotted lines.
Its value must be a positive number.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>, 
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>, 
<code>parametric</code> and <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>points</code> and <code>parametric</code>.
</li></ul>

<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^2,x,-1,1), /* default width */
             line_width = 5.5,
             explicit(1 + x^2,x,-1,1),
             line_width = 10,
             explicit(2 + x^2,x,-1,1))$
</pre>
<p>See also <code>line_type</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-line_005ftype"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>line_type</b>
<a name="IDX1834"></a>
</dt>
<dd><p>Default value: <code>solid</code>
</p>
<p><code>line_type</code> indicates how lines are displayed; possible values are
<code>solid</code> and <code>dots</code>.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>, 
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>, 
<code>parametric</code> and <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>points</code>, <code>explicit</code>, <code>parametric</code> and <code>parametric_surface</code>.
</li></ul>

<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(line_type = dots,
             explicit(1 + x^2,x,-1,1),
             line_type = solid, /* default */
             explicit(2 + x^2,x,-1,1))$
</pre>
<p>See also <code>line_width</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-nticks"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>nticks</b>
<a name="IDX1835"></a>
</dt>
<dd><p>Default value: 30
</p>
<p>In 2d, <code>nticks</code> gives the initial number of points used by the
adaptive plotting routine for explicit objects. It is also the
number of points that will be shown in parametric and polar curves.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>ellipse</code>, <code>explicit</code>, <code>parametric</code> and <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>parametric</code>.
</li></ul>

<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(transparent = true,
             ellipse(0,0,4,2,0,180),
             nticks = 5,
             ellipse(0,0,4,2,180,180) )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-adapt_005fdepth"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>adapt_depth</b>
<a name="IDX1836"></a>
</dt>
<dd><p>Default value: 10
</p>
<p><code>adapt_depth</code> is the maximum number of splittings used by the adaptive plotting routine.
</p>
<p>This option is relevant only for 2d <code>explicit</code> functions.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-key"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>key</b>
<a name="IDX1837"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p><code>key</code> is the name of a function in the legend. If <code>key</code> is an
empty string, no key is assigned to the function.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>,
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>,
<code>parametric</code>, and <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>points</code>, <code>explicit</code>, <code>parametric</code>,
and <code>parametric_surface</code>.
</li></ul>

<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(key   = &quot;Sinus&quot;,
             explicit(sin(x),x,0,10),
             key   = &quot;Cosinus&quot;,
             color = red,
             explicit(cos(x),x,0,10) )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-xu_005fgrid"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>xu_grid</b>
<a name="IDX1838"></a>
</dt>
<dd><p>Default value: 30
</p>
<p><code>xu_grid</code> is the number of coordinates of the first variable
(<code>x</code> in explicit and <code>u</code> in parametric 3d surfaces) to 
build the grid of sample points.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr3d</code>: <code>explicit</code> and <code>parametric_surface</code>.
</li></ul>

<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(xu_grid = 10,
             yv_grid = 50,
             explicit(x^2+y^2,x,-3,3,y,-3,3) )$
</pre>
<p>See also <code>yv_grid</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-yv_005fgrid"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>yv_grid</b>
<a name="IDX1839"></a>
</dt>
<dd><p>Default value: 30
</p>
<p><code>yv_grid</code> is the number of coordinates of the second variable
(<code>y</code> in explicit and <code>v</code> in parametric 3d surfaces) to 
build the grid of sample points.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr3d</code>: <code>explicit</code> and <code>parametric_surface</code>.
</li></ul>

<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(xu_grid = 10,
             yv_grid = 50,
             explicit(x^2+y^2,x,-3,3,y,-3,3) )$
</pre>
<p>See also <code>xu_grid</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-surface_005fhide"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>surface_hide</b>
<a name="IDX1840"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>surface_hide</code> is <code>true</code>, hidden parts are not plotted in 3d surfaces.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw(columns=2,
           gr3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3)),
           gr3d(surface_hide = true,
                explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3)) )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-contour"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>contour</b>
<a name="IDX1841"></a>
</dt>
<dd><p>Default value: <code>none</code>
</p>
<p>Option <code>contour</code> enables the user to select where to plot contour lines.
Possible values are:
</p>
<ul>
<li>
<code>none</code>:
no contour lines are plotted.

</li><li>
<code>base</code>:
contour lines are projected on the xy plane.

</li><li>
<code>surface</code>:
contour lines are plotted on the surface.

</li><li>
<code>both</code>:
two contour lines are plotted: on the xy plane and on the surface.

</li><li>
<code>map</code>:
contour lines are projected on the xy plane, and the view point is
set just in the vertical.

</li></ul>

<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = 15,
             contour        = both,
             surface_hide   = true) $
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-contour_005flevels"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>contour_levels</b>
<a name="IDX1842"></a>
</dt>
<dd><p>Default value: 5
</p>
<p>This graphic option controls the way contours are drawn. 
<code>contour_levels</code> can be set to a positive integer number, a list of three
numbers or an arbitrary set of numbers:
</p>
<ul>
<li>
When option <code>contour_levels</code> is bounded to positive integer <var>n</var>,
<var>n</var> contour lines will be drawn at equal intervals. By default, five
equally spaced contours are plotted.

</li><li>
When option <code>contour_levels</code> is bounded to a list of length three of the
form <code>[lowest,s,highest]</code>, contour lines are plotted from <code>lowest</code> 
to <code>highest</code> in steps of <code>s</code>.

</li><li>
When option <code>contour_levels</code> is bounded to a set of numbers of the
form <code>{n1, n2, ...}</code>, contour lines are plotted at values <code>n1</code>,
<code>n2</code>, ...
</li></ul>

<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Examples:
</p>
<p>Ten equally spaced contour lines. The actual number of
levels can be adjusted to give simple labels.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw3d(color = green,
             explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = 10,
             contour        = both,
             surface_hide   = true) $
</pre>

<p>From -8 to 8 in steps of 4.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw3d(color = green,
             explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = [-8,4,8],
             contour        = both,
             surface_hide   = true) $
</pre>
<p>Isolines at levels -7, -6, 0.8 and 5.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw3d(color = green,
             explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = {-7, -6, 0.8, 5},
             contour        = both,
             surface_hide   = true) $
</pre>
<p>See also <code>contour</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-columns"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>columns</b>
<a name="IDX1843"></a>
</dt>
<dd><p>Default value: 1
</p>
<p><code>columns</code> is the number of columns in multiple plots.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) scene1: gr2d(title=&quot;Ellipse&quot;,
                   nticks=30,
                   parametric(2*cos(t),5*sin(t),t,0,2*%pi))$
(%i3) scene2: gr2d(title=&quot;Triangle&quot;,
                   polygon([4,5,7],[6,4,2]))$
(%i4) draw(scene1, scene2, columns = 2)$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-ip_005fgrid"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>ip_grid</b>
<a name="IDX1844"></a>
</dt>
<dd><p>Default value: <code>[50, 50]</code>
</p>
<p><code>ip_grid</code> sets the grid for the first sampling in implicit plots.
</p>
<p>This option is relevant only for <code>implicit</code> objects.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-ip_005fgrid_005fin"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>ip_grid_in</b>
<a name="IDX1845"></a>
</dt>
<dd><p>Default value: <code>[5, 5]</code>
</p>
<p><code>ip_grid_in</code> sets the grid for the second sampling in implicit plots.
</p>
<p>This option is relevant only for <code>implicit</code> objects.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>

<p><a name="Item_003a-x_005fvoxel"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>x_voxel</b>
<a name="IDX1846"></a>
</dt>
<dd><p>Default value: 10
</p>
<p><code>x_voxel</code> is the number of voxels in the x direction to
be used by the <i>marching cubes algorithm</i> implemented
by the 3d <code>implicit</code> object.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>

<p><a name="Item_003a-y_005fvoxel"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>y_voxel</b>
<a name="IDX1847"></a>
</dt>
<dd><p>Default value: 10
</p>
<p><code>y_voxel</code> is the number of voxels in the y direction to
be used by the <i>marching cubes algorithm</i> implemented
by the 3d <code>implicit</code> object.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>

<p><a name="Item_003a-z_005fvoxel"></a>
</p><dl>
<dt><u>Graphic option:</u> <b>z_voxel</b>
<a name="IDX1848"></a>
</dt>
<dd><p>Default value: 10
</p>
<p><code>z_voxel</code> is the number of voxels in the z direction to
be used by the <i>marching cubes algorithm</i> implemented
by the 3d <code>implicit</code> object.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>








<p><a name="Item_003a-gr2d"></a>
</p><dl>
<dt><u>Scene constructor:</u> <b>gr2d</b><i> (<var>graphic option</var>, ..., <var>graphic object</var>, ...)</i>
<a name="IDX1849"></a>
</dt>
<dd><p>Function <code>gr2d</code> builds an object describing a 2D scene. Arguments are
<i>graphic options</i> and <i>graphic objects</i>. This scene is interpreted
sequentially: <i>graphic options</i> affect those <i>graphic objects</i> placed
on its right. Some <i>graphic options</i> affect the global appearence of the scene.
</p>
<p>This is the list of <i>graphic objects</i> available for scenes in two dimensions:
<code>points</code>, <code>polygon</code>, <code>rectangle</code>, <code>bars</code>, <code>ellipse</code>, <code>label</code>,
<code>vector</code>, <code>explicit</code>, <code>implicit</code>, <code>polar</code>, <code>parametric</code>,
<code>image</code> and <code>geomap</code>.
</p>
<p>See also the following global <i>graphic options</i>: <code>xrange</code>, <code>yrange</code>, 
<code>logx</code>, <code>logy</code>, <code>terminal</code>, <code>grid</code>, <code>title</code>, 
<code>xlabel</code>, <code>ylabel</code>, <code>xtics</code>, <code>ytics</code>, <code>xtics_rotate</code>, 
<code>ytics_rotate</code>, <code>xtics_axis</code>, <code>ytics_axis</code>, <code>xaxis</code>, <code>yaxis</code>, 
<code>xaxis_width</code>, <code>yaxis_width</code>, 
<code>xaxis_type</code>, <code>yaxis_type</code>, 
<code>xaxis_color</code>, <code>yaxis_color</code>, <code>xy_file</code>, 
<code>file_name</code>, <code>pic_width</code>, <code>pic_height</code>, 
<code>eps_width</code>, <code>eps_height</code>,
<code>user_preamble</code>, <code>axis_bottom</code>, <code>axis_left</code>, <code>axis_top</code> 
and <code>axis_right</code>.
</p>
<p>To make use of this function, write first <code>load(draw)</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-gr3d"></a>
</p><dl>
<dt><u>Scene constructor:</u> <b>gr3d</b><i> (<var>graphic option</var>, ..., <var>graphic object</var>, ...)</i>
<a name="IDX1850"></a>
</dt>
<dd><p>Function <code>gr3d</code> builds an object describing a 3d scene. Arguments are
<i>graphic options</i> and <i>graphic objects</i>. This scene is interpreted
sequentially: <i>graphic options</i> affect those <i>graphic objects</i> placed
on its right. Some <i>graphic options</i> affect the global appearence of the scene.
</p>
<p>This is the list of <i>graphic objects</i> available for scenes in three dimensions:
<code>points</code>, <code>label</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>,
<code>parametric</code>, <code>parametric_surface</code> and <code>geomap</code>.
</p>
<p>See also the following global <i>graphic options</i>: <code>xrange</code>, <code>yrange</code>, 
<code>zrange</code>, <code>logx</code>, <code>logy</code>, <code>logz</code>, <code>terminal</code>, 
<code>grid</code>, <code>title</code>, <code>xlabel</code>, <code>ylabel</code>, <code>zlabel</code>, 
<code>xtics</code>, <code>ytics</code>, <code>ztics</code>, <code>xtics_rotate</code>, 
<code>ytics_rotate</code>, <code>ztics_rotate</code>, <code>xtics_axis</code>, <code>ytics_axis</code>, 
<code>ztics_axis</code>, <code>xaxis</code>, <code>yaxis</code>, <code>zaxis</code>, 
<code>xaxis_width</code>, <code>yaxis_width</code>, <code>zaxis_width</code>, 
<code>xaxis_type</code>, <code>yaxis_type</code>, <code>zaxis_type</code>,
<code>xaxis_color</code>, <code>yaxis_color</code>, <code>zaxis_color</code>, <code>xy_file</code>, 
<code>user_preamble</code>, <code>axis_bottom</code>, <code>axis_left</code>, 
<code>axis_top</code>, <code>file_name</code>, <code>pic_width</code>, <code>pic_height</code>, 
<code>eps_width</code>, <code>eps_height</code>,
<code>axis_right</code>, <code>rot_vertical</code>, <code>rot_horizontal</code>, 
<code>axis_3d</code>, <code>xu_grid</code>, <code>yv_grid</code>, <code>surface_hide</code>, 
<code>contour</code>, <code>contour_levels</code>, <code>palette</code>, <code>colorbox</code>
and <code>enhanced3d</code>.
</p>
<p>To make use of this function, write first <code>load(draw)</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>







<p><a name="Item_003a-points"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>points</b><i> ([[<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>],...])</i>
<a name="IDX1851"></a>
</dt>
<dt><u>Graphic object:</u> <b>points</b><i> ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...])</i>
<a name="IDX1852"></a>
</dt>
<dt><u>Graphic object:</u> <b>points</b><i> ([<var>y1</var>,<var>y2</var>,...])</i>
<a name="IDX1853"></a>
</dt>
<dt><u>Graphic object:</u> <b>points</b><i> ([[<var>x1</var>,<var>y1</var>,<var>z1</var>], [<var>x2</var>,<var>y2</var>,<var>z2</var>],...])</i>
<a name="IDX1854"></a>
</dt>
<dt><u>Graphic object:</u> <b>points</b><i> ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...], [<var>z1</var>,<var>z2</var>,...])</i>
<a name="IDX1855"></a>
</dt>
<dt><u>Graphic object:</u> <b>points</b><i> (<var>matrix</var>)</i>
<a name="IDX1856"></a>
</dt>
<dd><p>Draws points in 2D and 3D.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>point_size</code>, 
<code>point_type</code>, <code>points_joined</code>, <code>line_width</code>, <code>key</code>,
<code>line_type</code> and <code>color</code>.
</p>
<p><b>2D</b>
</p>
<p><code>points ([[<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>],...])</code> or
<code>points ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...])</code>
plots points <code>[x1,y1]</code>, <code>[x2,y2]</code>, etc. If abscissas
are not given, they are set to consecutive positive integers, so that 
<code>points ([<var>y1</var>,<var>y2</var>,...])</code> draws points <code>[1,<var>y1</var>]</code>, <code>[2,<var>y2</var>]</code>, etc.
If <var>matrix</var> is a two-column or two-row matrix, <code>points (<var>matrix</var>)</code>
draws the associated points. If <var>matrix</var> is a one-column or one-row matrix,
abscissas are assigned automatically.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(
        key = &quot;Small points&quot;,
        points(makelist([random(20),random(50)],k,1,10)),
        point_type    = circle,
        point_size    = 3,
        points_joined = true,
        key           = &quot;Great points&quot;,
        points(makelist(k,k,1,20),makelist(random(30),k,1,20)),
        point_type    = filled_down_triangle,
        key           = &quot;Automatic abscissas&quot;,
        color         = red,
        points([2,12,8]))$
</pre>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(
        points_joined = impulses,
        line_width    = 2,
        color         = red,
        points(makelist([random(20),random(50)],k,1,10)))$
</pre>
<p><b>3D</b>
</p>
<p><code>points ([[<var>x1</var>,<var>y1</var>,<var>z1</var>], [<var>x2</var>,<var>y2</var>,<var>z2</var>],...])</code> or 
<code>points ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...], [<var>z1</var>,<var>z2</var>,...])</code>
plots points <code>[<var>x1</var>,<var>y1</var>,<var>z1</var>]</code>, <code>[<var>x2</var>,<var>y2</var>,<var>z2</var>]</code>, etc.
If <var>matrix</var> is a three-column or three-row matrix, <code>points (<var>matrix</var>)</code>
draws the associated points.
</p>
<p>Examples:
</p>
<p>One tridimensional sample,
</p><pre class="example">(%i1) load(draw)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) draw3d(title = &quot;Daily average wind speeds&quot;,
             point_size = 2,
             points(args(submatrix (s2, 4, 5))) )$
</pre>
<p>Two tridimensional samples,
</p><pre class="example">(%i1) load(draw)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) draw3d(
         title = &quot;Daily average wind speeds. Two data sets&quot;,
         point_size = 2,
         key        = &quot;Sample from stations 1, 2 and 3&quot;,
         points(args(submatrix (s2, 4, 5))),
         point_type = 4,
         key        = &quot;Sample from stations 1, 4 and 5&quot;,
         points(args(submatrix (s2, 2, 3))) )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-polygon"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>polygon</b><i> ([[<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>],...])</i>
<a name="IDX1857"></a>
</dt>
<dt><u>Graphic object:</u> <b>polygon</b><i> ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...])</i>
<a name="IDX1858"></a>
</dt>
<dd><p>Draws polygons in 2D.
</p>
<p><b>2D</b>
</p>
<p><code>polygon ([[<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>],...])</code> or 
<code>polygon ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...])</code>:
plots on the plane a polygon with vertices <code>[<var>x1</var>,<var>y1</var>]</code>, <code>[<var>x2</var>,<var>y2</var>]</code>, etc..
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>transparent</code>, 
<code>fill_color</code>, <code>border</code>, <code>line_width</code>, <code>key</code>,
 <code>line_type</code> and <code>color</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(color      = &quot;#e245f0&quot;,
             line_width = 8,
             polygon([[3,2],[7,2],[5,5]]),
             border      = false,
             fill_color  = yellow,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-rectangle"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>rectangle</b><i> ([<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>])</i>
<a name="IDX1859"></a>
</dt>
<dd><p>Draws rectangles in 2D.
</p>
<p><b>2D</b>
</p>
<p><code>rectangle ([<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>])</code> draws a rectangle with opposite vertices
<code>[<var>x1</var>,<var>y1</var>]</code> and <code>[<var>x2</var>,<var>y2</var>]</code>.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>transparent</code>, 
<code>fill_color</code>, <code>border</code>, <code>line_width</code>, <code>key</code>,
<code>line_type</code> and <code>color</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(fill_color  = red,
             line_width  = 6,
             line_type   = dots,
             transparent = false,
             fill_color  = blue,
             rectangle([-2,-2],[8,-1]), /* opposite vertices */
             transparent = true,
             line_type   = solid,
             line_width  = 1,
             rectangle([9,4],[2,-1.5]),
             xrange      = [-3,10],
             yrange      = [-3,4.5] )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-bars"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>bars</b><i> ([<var>x1</var>,<var>h1</var>,<var>w1</var>], [<var>x2</var>,<var>h2</var>,<var>w2</var>, ...])</i>
<a name="IDX1860"></a>
</dt>
<dd><p>Draws vertical bars in 2D.
</p>
<p><b>2D</b>
</p>
<p><code>bars ([<var>x1</var>,<var>h1</var>,<var>w1</var>], [<var>x2</var>,<var>h2</var>,<var>w2</var>, ...])</code> 
draws bars centered at values <var>x1</var>, <var>x2</var>, ... with heights <var>h1</var>, <var>h2</var>, ...
and widths <var>w1</var>, <var>w2</var>, ...
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>key</code>, 
<code>fill_color</code>, <code>fill_density</code> and <code>line_width</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(
       key          = &quot;Group A&quot;,
       fill_color   = blue,
       fill_density = 0.2,
       bars([0.8,5,0.4],[1.8,7,0.4],[2.8,-4,0.4]),
       key          = &quot;Group B&quot;,
       fill_color   = red,
       fill_density = 0.6,
       line_width   = 4,
       bars([1.2,4,0.4],[2.2,-2,0.4],[3.2,5,0.4]),
       xaxis = true);
</pre></dd></dl>



<p><a name="Item_003a-ellipse"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>ellipse</b><i> (<var>xc</var>, <var>yc</var>, <var>a</var>, <var>b</var>, <var>ang1</var>, <var>ang2</var>)</i>
<a name="IDX1861"></a>
</dt>
<dd><p>Draws ellipses and circles in 2D.
</p>

<p><b>2D</b>
</p>
<p><code>ellipse (<var>xc</var>, <var>yc</var>, <var>a</var>, <var>b</var>, <var>ang1</var>, <var>ang2</var>)</code>
plots an ellipse centered at <code>[<var>xc</var>, <var>yc</var>]</code> with horizontal and vertical
semi axis <var>a</var> and <var>b</var>, respectively, from angle <var>ang1</var> to angle
<var>ang2</var>.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>nticks</code>, 
<code>transparent</code>, <code>fill_color</code>, <code>border</code>, <code>line_width</code>, 
<code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(transparent = false,
             fill_color  = red,
             color       = gray30,
             transparent = false,
             line_width  = 5,
             ellipse(0,6,3,2,270,-270),
             /* center (x,y), a, b, start &amp; end in degrees */
             transparent = true,
             color       = blue,
             line_width  = 3,
             ellipse(2.5,6,2,3,30,-90),
             xrange      = [-3,6],
             yrange      = [2,9] )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-label"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>label</b><i> ([<var>string</var>,<var>x</var>,<var>y</var>],...)</i>
<a name="IDX1862"></a>
</dt>
<dt><u>Graphic object:</u> <b>label</b><i> ([<var>string</var>,<var>x</var>,<var>y</var>,<var>z</var>],...)</i>
<a name="IDX1863"></a>
</dt>
<dd><p>Writes labels in 2D and 3D.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>label_alignment</code>, 
<code>label_orientation</code> and <code>color</code>.
</p>
<p><b>2D</b>
</p>
<p><code>label([<var>string</var>,<var>x</var>,<var>y</var>])</code> writes the <var>string</var> at point
<code>[<var>x</var>,<var>y</var>]</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(yrange = [0.1,1.4],
             color = &quot;red&quot;,
             label([&quot;Label in red&quot;,0,0.3]),
             color = &quot;#0000ff&quot;,
             label([&quot;Label in blue&quot;,0,0.6]),
             color = &quot;light-blue&quot;,
             label([&quot;Label in light-blue&quot;,0,0.9],
                   [&quot;Another light-blue&quot;,0,1.2])  )$
</pre>
<p><b>3D</b>
</p>
<p><code>label([<var>string</var>,<var>x</var>,<var>y</var>,<var>z</var>])</code> writes the <var>string</var> at point
<code>[<var>x</var>,<var>y</var>,<var>z</var>]</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3),
             color = red,
             label([&quot;UP 1&quot;,-2,0,3], [&quot;UP 2&quot;,1.5,0,4]),
             color = blue,
             label([&quot;DOWN 1&quot;,2,0,-3]) )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>



<p><a name="Item_003a-vector"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>vector</b><i> ([<var>x</var>,<var>y</var>], [<var>dx</var>,<var>dy</var>])</i>
<a name="IDX1864"></a>
</dt>
<dt><u>Graphic object:</u> <b>vector</b><i> ([<var>x</var>,<var>y</var>,<var>z</var>], [<var>dx</var>,<var>dy</var>,<var>dz</var>])</i>
<a name="IDX1865"></a>
</dt>
<dd><p>Draws vectors in 2D and 3D.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>head_both</code>, 
<code>head_length</code>, <code>head_angle</code>, <code>head_type</code>, <code>line_width</code>, 
<code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p><b>2D</b>
</p>
<p><code>vector([<var>x</var>,<var>y</var>], [<var>dx</var>,<var>dy</var>])</code> plots vector
<code>[<var>dx</var>,<var>dy</var>]</code> with origin in <code>[<var>x</var>,<var>y</var>]</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,10],
             head_length = 1,
             vector([0,1],[5,5]), /* default type */
             head_type = 'empty,
             vector([3,1],[5,5]),
             head_both = true,
             head_type = 'nofilled,
             line_type = dots,
             vector([6,1],[5,5]))$
</pre>
<p><b>3D</b>
</p>
<p><code>vector([<var>x</var>,<var>y</var>,<var>z</var>], [<var>dx</var>,<var>dy</var>,<var>dz</var>])</code> 
plots vector <code>[<var>dx</var>,<var>dy</var>,<var>dz</var>]</code> with
origin in <code>[<var>x</var>,<var>y</var>,<var>z</var>]</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(color = cyan,
             vector([0,0,0],[1,1,1]/sqrt(3)),
             vector([0,0,0],[1,-1,0]/sqrt(2)),
             vector([0,0,0],[1,1,-2]/sqrt(6)) )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-explicit"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>explicit</b><i> (<var>fcn</var>,<var>var</var>,<var>minval</var>,<var>maxval</var>)</i>
<a name="IDX1866"></a>
</dt>
<dt><u>Graphic object:</u> <b>explicit</b><i> (<var>fcn</var>,<var>var1</var>,<var>minval1</var>,<var>maxval1</var>,<var>var2</var>,<var>minval2</var>,<var>maxval2</var>)</i>
<a name="IDX1867"></a>
</dt>
<dd><p>Draws explicit functions in 2D and 3D.
</p>
<p><b>2D</b>
</p>
<p><code>explicit(<var>fcn</var>,<var>var</var>,<var>minval</var>,<var>maxval</var>)</code> plots explicit function <var>fcn</var>,
with variable <var>var</var> taking values from <var>minval</var> to <var>maxval</var>.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>nticks</code>, 
<code>adapt_depth</code>, <code>line_width</code>, <code>line_type</code>, <code>key</code>, 
<code>filled_func</code>, <code>fill_color</code> and <code>color</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(line_width = 3,
             color      = blue,
             explicit(x^2,x,-3,3) )$
(%i3) draw2d(fill_color  = brown,
             filled_func = true,
             explicit(x^2,x,-3,3) )$
</pre>
<p><b>3D</b>
</p>
<p><code>explicit(<var>fcn</var>,<var>var1</var>,<var>minval1</var>,<var>maxval1</var>,<var>var2</var>,<var>minval2</var>,<var>maxval2</var>)</code>
plots explicit function <var>fcn</var>, with variable <var>var1</var> taking values
from <var>minval1</var> to <var>maxval1</var> and variable <var>var2</var> taking values
from <var>minval2</var> to <var>maxval2</var>.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(key   = &quot;Gauss&quot;,
             color = &quot;#a02c00&quot;,
             explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3),
             yv_grid     = 10,
             color = blue,
             key   = &quot;Plane&quot;,
             explicit(x+y,x,-5,5,y,-5,5),
             surface_hide = true)$
</pre>
<p>See also <code>filled_func</code> for filled functions.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-implicit"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>implicit</b><i> (<var>fcn</var>,<var>x</var>,<var>xmin</var>,<var>xmax</var>,<var>y</var>,<var>ymin</var>,<var>ymax</var>)</i>
<a name="IDX1868"></a>
</dt>
<dt><u>Graphic object:</u> <b>implicit</b><i> (<var>fcn</var>,<var>x</var>,<var>xmin</var>,<var>xmax</var>,<var>y</var>,<var>ymin</var>,<var>ymax</var>,<var>z</var>,<var>zmin</var>,<var>zmax</var>)</i>
<a name="IDX1869"></a>
</dt>
<dd><p>Draws implicit functions in 2D and 3D.
</p>
<p><b>2D</b>
</p>
<p><code>implicit(<var>fcn</var>,<var>x</var>,<var>xmin</var>,<var>xmax</var>,<var>y</var>,<var>ymin</var>,<var>ymax</var>)</code>
plots the implicit function defined by <var>fcn</var>, with variable <var>x</var> taking values
from <var>xmin</var> to <var>xmax</var>, and variable <var>y</var> taking values
from <var>ymin</var> to <var>ymax</var>.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>ip_grid</code>, 
<code>ip_grid_in</code>, <code>line_width</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal  = eps,
             grid      = true,
             line_type = solid,
             key       = &quot;y^2=x^3-2*x+1&quot;,
             implicit(y^2=x^3-2*x+1, x, -4,4, y, -4,4),
             line_type = dots,
             key       = &quot;x^3+y^3 = 3*x*y^2-x-1&quot;,
             implicit(x^3+y^3 = 3*x*y^2-x-1, x,-4,4, y,-4,4),
             title     = &quot;Two implicit functions&quot; )$
</pre>
<p><b>3D</b>
</p>
<p><code>implicit (<var>fcn</var>,<var>x</var>,<var>xmin</var>,<var>xmax</var>, <var>y</var>,<var>ymin</var>,<var>ymax</var>, <var>z</var>,<var>zmin</var>,<var>zmax</var>)</code>
plots the implicit surface defined by <var>fcn</var>, with variable <var>x</var> taking values
from <var>xmin</var> to <var>xmax</var>, variable <var>y</var> taking values
from <var>ymin</var> to <var>ymax</var> and variable <var>z</var> taking values
from <var>zmin</var> to <var>zmax</var>. This object implements the <i>marching cubes algorithm</i>.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>x_voxel</code>, 
<code>y_voxel</code>, <code>z_voxel</code>, <code>line_width</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(
        color=blue,
        implicit((x^2+y^2+z^2-1)*(x^2+(y-1.5)^2+z^2-0.5)=0.015,
                 x,-1,1,y,-1.2,2.3,z,-1,1),
        surface_hide=true);
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>

</dd></dl>


<p><a name="Item_003a-polar"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>polar</b><i> (<var>radius</var>,<var>ang</var>,<var>minang</var>,<var>maxang</var>)</i>
<a name="IDX1870"></a>
</dt>
<dd><p>Draws 2D functions defined in polar coordinates.
</p>
<p><b>2D</b>
</p>
<p><code>polar (<var>radius</var>,<var>ang</var>,<var>minang</var>,<var>maxang</var>)</code> plots function 
<code><var>radius</var>(<var>ang</var>)</code> defined in polar coordinates, with variable 
<var>ang</var> taking values from 
<var>minang</var> to <var>maxang</var>.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>nticks</code>, 
<code>line_width</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(user_preamble = &quot;set grid polar&quot;,
             nticks        = 200,
             xrange        = [-5,5],
             yrange        = [-5,5],
             color         = blue,
             line_width    = 3,
             title         = &quot;Hyperbolic Spiral&quot;,
             polar(10/theta,theta,1,10*%pi) )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-spherical"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>spherical</b><i> (<var>radius</var>,<var>azi</var>,<var>minazi</var>,<var>maxazi</var>,<var>zen</var>,<var>minzen</var>,<var>maxzen</var>)</i>
<a name="IDX1871"></a>
</dt>
<dd><p>Draws 3D functions defined in spherical coordinates.
</p>
<p><b>3D</b>
</p>
<p><code>spherical (<var>radius</var>,<var>azi</var>,<var>minazi</var>,<var>maxazi</var>,<var>zen</var>,<var>minzen</var>,<var>maxzen</var>)</code>
plots function <code><var>radius</var>(<var>azi</var>,<var>zen</var>)</code> defined in spherical coordinates, with <i>azimuth</i>
<var>azi</var> taking values from <var>minazi</var> to <var>maxazi</var> and <i>zenith</i> <var>zen</var> taking values from
<var>minzen</var> to <var>maxzen</var>.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(spherical(1,a,0,2*%pi,z,0,%pi))$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-cylindrical"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>cylindrical</b><i> (<var>radius</var>,<var>z</var>,<var>minz</var>,<var>maxz</var>,<var>azi</var>,<var>minazi</var>,<var>maxazi</var>)</i>
<a name="IDX1872"></a>
</dt>
<dd><p>Draws 3D functions defined in cylindrical coordinates.
</p>
<p><b>3D</b>
</p>
<p><code>cylindrical (<var>radius</var>,<var>z</var>,<var>minz</var>,<var>maxz</var>,<var>azi</var>,<var>minazi</var>,<var>maxazi</var>)</code>
plots function <code><var>radius</var>(<var>z</var>,<var>azi</var>)</code> defined in cylindrical coordinates, with variable
<var>z</var> taking values from <var>minz</var> to <var>maxz</var> and <i>azimuth</i> <var>azi</var> taking values from
<var>minazi</var> to <var>maxazi</var>.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(cylindrical(1,z,-2,2,az,0,2*%pi))$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-parametric"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>parametric</b><i> (<var>xfun</var>,<var>yfun</var>,<var>par</var>,<var>parmin</var>,<var>parmax</var>)</i>
<a name="IDX1873"></a>
</dt>
<dt><u>Graphic object:</u> <b>parametric</b><i> (<var>xfun</var>,<var>yfun</var>,<var>zfun</var>,<var>par</var>,<var>parmin</var>,<var>parmax</var>)</i>
<a name="IDX1874"></a>
</dt>
<dd><p>Draws parametric functions in 2D and 3D.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>nticks</code>, 
<code>line_width</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p><b>2D</b>
</p>
<p><code>parametric (<var>xfun</var>,<var>yfun</var>,<var>par</var>,<var>parmin</var>,<var>parmax</var>)</code> plots parametric function 
<code>[<var>xfun</var>,<var>yfun</var>]</code>, with parameter <var>par</var> taking values from 
<var>parmin</var> to <var>parmax</var>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(exp(x),x,-1,3),
             color = red,
             key   = &quot;This is the parametric one!!&quot;,
             parametric(2*cos(rrr),rrr^2,rrr,0,2*%pi))$
</pre>
<p><b>3D</b>
</p>
<p><code>parametric (<var>xfun</var>,<var>yfun</var>,<var>zfun</var>,<var>par</var>,<var>parmin</var>,<var>parmax</var>)</code> plots parametric curve 
<code>[<var>xfun</var>,<var>yfun</var>,<var>zfun</var>]</code>, with parameter <var>par</var> taking values from 
<var>parmin</var> to <var>parmax</var>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3),
             color = royalblue,
             parametric(cos(5*u)^2,sin(7*u),u-2,u,0,2),
             color      = turquoise,
             line_width = 2,
             parametric(t^2,sin(t),2+t,t,0,2),
             surface_hide = true,
             title = &quot;Surface &amp; curves&quot; )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-image"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>image</b><i> (<var>im</var>,<var>x0</var>,<var>y0</var>,<var>width</var>,<var>height</var>)</i>
<a name="IDX1875"></a>
</dt>
<dd><p>Renders images in 2D.
</p>
<p><b>2D</b>
</p>
<p><code>image (<var>im</var>,<var>x0</var>,<var>y0</var>,<var>width</var>,<var>height</var>)</code> plots image <var>im</var> in the rectangular
region from vertex <code>(<var>x0</var>,<var>y0</var>)</code> to <code>(x0+<var>width</var>,y0+<var>height</var>)</code> on the real
plane. Argument <var>im</var> must be a matrix of real numbers, a matrix of
vectors of length three or a <var>picture</var> object.
</p>
<p>If <var>im</var> is a matrix of real numbers or a <var>levels picture</var> object,
pixel values are interpreted according to graphic option <code>palette</code>, 
which is a vector of length three with components 
ranging from -36 to +36; each value is an index for a formula mapping the levels
onto red, green and blue colors, respectively:
</p><pre class="example"> 0: 0               1: 0.5           2: 1
 3: x               4: x^2           5: x^3
 6: x^4             7: sqrt(x)       8: sqrt(sqrt(x))
 9: sin(90x)       10: cos(90x)     11: |x-0.5|
12: (2x-1)^2       13: sin(180x)    14: |cos(180x)|
15: sin(360x)      16: cos(360x)    17: |sin(360x)|
18: |cos(360x)|    19: |sin(720x)|  20: |cos(720x)|
21: 3x             22: 3x-1         23: 3x-2
24: |3x-1|         25: |3x-2|       26: (3x-1)/2
27: (3x-2)/2       28: |(3x-1)/2|   29: |(3x-2)/2|
30: x/0.32-0.78125                  31: 2*x-0.84
32: 4x;1;-2x+1.84;x/0.08-11.5
33: |2*x - 0.5|    34: 2*x          35: 2*x - 0.5
36: 2*x - 1
</pre><p>negative numbers mean negative colour component.
</p>
<p><code>palette = gray</code> and <code>palette = color</code> are short cuts for
<code>palette = [3,3,3]</code> and <code>palette = [7,5,15]</code>, respectively.
</p>
<p>If <var>im</var> is a matrix of vectors of length three or an <var>rgb picture</var> object,
they are interpreted as red, green and blue color components.
</p>
<p>Examples:
</p>
<p>If <var>im</var> is a matrix of real numbers, pixel values are interpreted according
to graphic option <code>palette</code>.
</p><pre class="example">(%i1) load(draw)$
(%i2) im: apply(
           'matrix,
            makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) /* palette = color, default */
      draw2d(image(im,0,0,30,30))$
(%i4) draw2d(palette = gray, image(im,0,0,30,30))$
(%i5) draw2d(palette = [15,20,-4],
             colorbox=false,
             image(im,0,0,30,30))$
</pre>
<p>See also <code>colorbox</code>.
</p>
<p>If <var>im</var> is a matrix of vectors of length three, they are interpreted
as red, green and blue color components.
</p><pre class="example">(%i1) load(draw)$
(%i2) im: apply(
            'matrix,
             makelist(
               makelist([random(300),
                         random(300),
                         random(300)],i,1,30),i,1,30))$
(%i3) draw2d(image(im,0,0,30,30))$
</pre>
<p>Package <code>draw</code> automatically loads package <code>picture</code>. In this
example, a level picture object is built by hand and then rendered.
</p><pre class="example">(%i1) load(draw)$
(%i2) im: make_level_picture([45,87,2,134,204,16],3,2);
(%o2)       picture(level, 3, 2, {Array:  #(45 87 2 134 204 16)})
(%i3) /* default color palette */
      draw2d(image(im,0,0,30,30))$
(%i4) /* gray palette */
      draw2d(palette = gray,
             image(im,0,0,30,30))$
</pre>
<p>An xpm file is read and then rendered.
</p><pre class="example">(%i1) load(draw)$
(%i2) im: read_xpm(&quot;myfile.xpm&quot;)$
(%i3) draw2d(image(im,0,0,10,7))$
</pre>
<p>See also <code>make_level_picture</code>, <code>make_rgb_picture</code> and <code>read_xpm</code>.
</p>
<p>URL <a href="http://www.telefonica.net/web2/biomates/maxima/gpdraw/image">http://www.telefonica.net/web2/biomates/maxima/gpdraw/image</a>
contains more elaborated examples.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-boundaries_005farray"></a>
</p><dl>
<dt><u>Global variable:</u> <b>boundaries_array</b>
<a name="IDX1876"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p><code>boundaries_array</code> is where the graphic object <code>geomap</code> looks
for boundaries coordinates.
</p>
<p>Each component of <code>boundaries_array</code> is an array of floating
point quantities, the coordinates of a polygonal segment or map boundary.
</p>
<p>See also <code>geomap</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-geomap"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>geomap</b><i> (<var>numlist</var>)</i>
<a name="IDX1877"></a>
</dt>
<dt><u>Graphic object:</u> <b>geomap</b><i> (<var>numlist</var>,<var>3Dprojection</var>)</i>
<a name="IDX1878"></a>
</dt>
<dd><p>Draws cartographic maps in 2D and 3D.
</p>
<p><b>2D</b>
</p>
<p>This function works together with global variable <code>boundaries_array</code>.
</p>
<p>Argument <var>numlist</var> is a list containing numbers or lists of numbers.
All these numbers must be integers greater or equal than zero, 
representing the components of global array <code>boundaries_array</code>.
</p>
<p>Each component of <code>boundaries_array</code> is an array of floating
point quantities, the coordinates of a polygonal segment or map boundary.
</p>
<p><code>geomap (<var>numlist</var>)</code> flattens its arguments and draws the
associated boundaries in <code>boundaries_array</code>.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>line_width</code>, 
<code>line_type</code> and <code>color</code>.
</p>
<p>Examples:
</p>
<p>A simple map defined by hand:
</p><pre class="example">(%i1) load(draw)$
(%i2) /* Vertices of boundary #0: {(1,1),(2,5),(4,3)} */
   ( bnd0: make_array(flonum,6),
     bnd0[0]:1.0, bnd0[1]:1.0, bnd0[2]:2.0,
     bnd0[3]:5.0, bnd0[4]:4.0, bnd0[5]:3.0 )$
(%i3) /* Vertices of boundary #1: {(4,3),(5,4),(6,4),(5,1)} */
   ( bnd1: make_array(flonum,8),
     bnd1[0]:4.0, bnd1[1]:3.0, bnd1[2]:5.0, bnd1[3]:4.0,
     bnd1[4]:6.0, bnd1[5]:4.0, bnd1[6]:5.0, bnd1[7]:1.0)$
(%i4) /* Vertices of boundary #2: {(5,1), (3,0), (1,1)} */
   ( bnd2: make_array(flonum,6),
     bnd2[0]:5.0, bnd2[1]:1.0, bnd2[2]:3.0,
     bnd2[3]:0.0, bnd2[4]:1.0, bnd2[5]:1.0 )$
(%i5) /* Vertices of boundary #3: {(1,1), (4,3)} */
   ( bnd3: make_array(flonum,4),
     bnd3[0]:1.0, bnd3[1]:1.0, bnd3[2]:4.0, bnd3[3]:3.0)$
(%i6) /* Vertices of boundary #4: {(4,3), (5,1)} */
   ( bnd4: make_array(flonum,4),
     bnd4[0]:4.0, bnd4[1]:3.0, bnd4[2]:5.0, bnd4[3]:1.0)$
(%i7) /* Pack all together in boundaries_array */
   ( boundaries_array: make_array(any,5),
     boundaries_array[0]: bnd0, boundaries_array[1]: bnd1,
     boundaries_array[2]: bnd2, boundaries_array[3]: bnd3,
     boundaries_array[4]: bnd4 )$
(%i8) draw2d(geomap([0,1,2,3,4]))$
</pre>
<p>Auxiliary package <code>worldmap</code> sets global variable
<code>boundaries_array</code> to real world boundaries in
(longitude, latitude) coordinates. These data are in the 
public domain and come from 
<a href="http://www-cger.nies.go.jp/grid-e/gridtxt/grid19.html">http://www-cger.nies.go.jp/grid-e/gridtxt/grid19.html</a>.
Package <code>worldmap</code> defines also boundaries for countries,
continents and coastlines as lists with the necessary components of 
<code>boundaries_array</code> (see file <code>share/draw/worldmap.mac</code>
for more information). Package <code>draw</code> does not
automatically load <code>worldmap</code>.
</p><pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) c1: gr2d(geomap(Canada,United_States,
                      Mexico,Cuba))$
(%i4) c2: gr2d(geomap(Africa))$
(%i5) c3: gr2d(geomap(Oceania,China,Japan))$
(%i6) c4: gr2d(geomap(France,Portugal,Spain,
                      Morocco,Western_Sahara))$
(%i7) draw(columns  = 2,
           c1,c2,c3,c4)$
</pre>
<p>Package <code>worldmap</code> is also useful for plotting
countries as polygons. In this case, graphic object
<code>geomap</code> is no longer necessary and the <code>polygon</code>
object is used instead. Since lists are now used and not
arrays, maps rendering will be slower. See also <code>make_poly_country</code>
and <code>make_poly_continent</code> to understand the following code.
</p><pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) mymap: append(
   [color      = white],  /* borders are white */
   [fill_color = red],             make_poly_country(Bolivia),
   [fill_color = cyan],            make_poly_country(Paraguay),
   [fill_color = green],           make_poly_country(Colombia),
   [fill_color = blue],            make_poly_country(Chile),
   [fill_color = &quot;#23ab0f&quot;],       make_poly_country(Brazil),
   [fill_color = goldenrod],       make_poly_country(Argentina),
   [fill_color = &quot;midnight-blue&quot;], make_poly_country(Uruguay))$
(%i4) apply(draw2d, mymap)$
</pre>

<p><b>3D</b>
</p>
<p><code>geomap (<var>numlist</var>)</code> projects map boundaries on the sphere of radius 1
centered at (0,0,0). It is possible to change the sphere or the projection type
by using <code>geomap (<var>numlist</var>,<var>3Dprojection</var>)</code>.
</p>
<p>Available 3D projections:
</p>
<ul>
<li>
<code>[spherical_projection,<var>x</var>,<var>y</var>,<var>z</var>,<var>r</var>]</code>: projects map boundaries on the sphere of
radius <var>r</var> centered at (<var>x</var>,<var>y</var>,<var>z</var>).
<pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) draw3d(geomap(Australia), /* default projection */
             geomap(Australia,
                    [spherical_projection,2,2,2,3]))$
</pre>
</li><li>
<code>[cylindrical_projection,<var>x</var>,<var>y</var>,<var>z</var>,<var>r</var>,<var>rc</var>]</code>: re-projects spherical map boundaries on the cylinder of radius
<var>rc</var> and axis passing through the poles of the globe of radius <var>r</var> centered at (<var>x</var>,<var>y</var>,<var>z</var>).
<pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) draw3d(geomap([America_coastlines,Eurasia_coastlines],
                    [cylindrical_projection,2,2,2,3,4]))$
</pre>
</li><li>
<code>[conic_projection,<var>x</var>,<var>y</var>,<var>z</var>,<var>r</var>,<var>alpha</var>]</code>: re-projects spherical map boundaries on the cones of angle <var>alpha</var>,
with axis passing through the poles of the globe of radius <var>r</var> centered at (<var>x</var>,<var>y</var>,<var>z</var>). Both 
the northern and southern cones are tangent to sphere.
<pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) draw3d(geomap(World_coastlines,
                    [conic_projection,0,0,0,1,90]))$
</pre></li></ul>

<p>See also <a href="http://www.telefonica.net/web2/biomates/maxima/gpdraw/geomap">http://www.telefonica.net/web2/biomates/maxima/gpdraw/geomap</a>
for more elaborated examples.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>








<p><a name="Item_003a-parametric_005fsurface"></a>
</p><dl>
<dt><u>Graphic object:</u> <b>parametric_surface</b><i> (<var>xfun</var>,<var>yfun</var>,<var>zfun</var>,<var>par1</var>,<var>par1min</var>,<var>par1max</var>,<var>par2</var>,<var>par2min</var>,<var>par2max</var>)</i>
<a name="IDX1879"></a>
</dt>
<dd><p>Draws parametric surfaces in 3D.
</p>
<p><b>3D</b>
</p>
<p><code>parametric_surface (<var>xfun</var>,<var>yfun</var>,<var>zfun</var>,<var>par1</var>,<var>par1min</var>,<var>par1max</var>,<var>par2</var>,<var>par2min</var>,<var>par2max</var>)</code>
plots parametric surface <code>[<var>xfun</var>,<var>yfun</var>,<var>zfun</var>]</code>, with parameter <var>par1</var>
taking values from <var>par1min</var> to <var>par1max</var> and parameter <var>par2</var>
taking values from <var>par2min</var> to <var>par2max</var>.
</p>
<p>This object is affected by the following <i>graphic options</i>: <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(title          = &quot;Sea shell&quot;,
             xu_grid        = 100,
             yv_grid        = 25,
             rot_vertical   = 100,
             rot_horizontal = 20,
             surface_hide   = true,
             parametric_surface(0.5*u*cos(u)*(cos(v)+1),
                           0.5*u*sin(u)*(cos(v)+1),
                           u*sin(v) - ((u+3)/8*%pi)^2 - 20,
                           u, 0, 13*%pi, v, -%pi, %pi) )$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>










<p><a name="Item_003a-draw"></a>
</p><dl>
<dt><u>Function:</u> <b>draw</b><i> (<var>gr2d</var>, ..., <var>gr3d</var>, ..., <var>options</var>, ...)</i>
<a name="IDX1880"></a>
</dt>
<dd><p>Plots a series of scenes; its arguments are <code>gr2d</code> and/or <code>gr3d</code> 
objects, together with some options. By default, the scenes are put together
in one column.
</p>
<p>Function <code>draw</code> accepts the following global options: <code>terminal</code>,
<code>columns</code>, <code>pic_width</code>, <code>pic_height</code>, <code>eps_width</code>,
<code>eps_height</code>, <code>file_name</code> and <code>delay</code>.
</p>
<p>Functions <code>draw2d</code> and <code>draw3d</code> are short cuts to be used 
when only one scene is required, in two or three dimensions, respectively.
</p>
<p>To make use of this function, write first <code>load(draw)</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) scene1: gr2d(title=&quot;Ellipse&quot;,
                   nticks=30,
                   parametric(2*cos(t),5*sin(t),t,0,2*%pi))$
(%i3) scene2: gr2d(title=&quot;Triangle&quot;,
                   polygon([4,5,7],[6,4,2]))$
(%i4) draw(scene1, scene2, columns = 2)$
</pre>
<p>The two draw sentences are equivalent:
</p><pre class="example">(%i1) load(draw)$
(%i2) draw(gr3d(explicit(x^2+y^2,x,-1,1,y,-1,1)));
(%o2)                          [gr3d(explicit)]
(%i3) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1));
(%o3)                          [gr3d(explicit)]
</pre>
<p>An animated gif file:
</p><pre class="example">(%i1) load(draw)$
(%i2) draw(
        delay     = 100,
        file_name = &quot;zzz&quot;,
        terminal  = 'animated_gif,
        gr2d(explicit(x^2,x,-1,1)),
        gr2d(explicit(x^3,x,-1,1)),
        gr2d(explicit(x^4,x,-1,1)));
End of animation sequence
(%o2)          [gr2d(explicit), gr2d(explicit), gr2d(explicit)]
</pre>
<p>See also <code>gr2d</code>, <code>gr3d</code>, <code>draw2d</code> and <code>draw3d</code>..
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
 &middot;
@ref{Category: File output}
</p>
</div>

</dd></dl>

<p><a name="Item_003a-draw2d"></a>
</p><dl>
<dt><u>Function:</u> <b>draw2d</b><i> (<var>option</var>, <var>graphic_object</var>, ...)</i>
<a name="IDX1881"></a>
</dt>
<dd><p>This function is a short cut for
<code>draw(gr2d(<var>options</var>, ..., <var>graphic_object</var>, ...))</code>.
</p>
<p>It can be used to plot a unique scene in 2d.
</p>
<p>To make use of this function, write first <code>load(draw)</code>.
</p>
<p>See also <code>draw</code> and <code>gr2d</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
 &middot;
@ref{Category: File output}
</p>
</div>

</dd></dl>


<p><a name="Item_003a-draw3d"></a>
</p><dl>
<dt><u>Function:</u> <b>draw3d</b><i> (<var>option</var>, <var>graphic_object</var>, ...)</i>
<a name="IDX1882"></a>
</dt>
<dd><p>This function is a short cut for
<code>draw(gr3d(<var>options</var>, ..., <var>graphic_object</var>, ...))</code>.
</p>
<p>It can be used to plot a unique scene in 3d.
</p>
<p>To make use of this function, write first <code>load(draw)</code>.
</p>
<p>See also <code>draw</code> and <code>gr3d</code>.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
 &middot;
@ref{Category: File output}
</p>
</div>

</dd></dl>




<p><a name="Item_003a-Functions-and-Variables-for-pictures"></a>
</p><hr size="6">
<a name="Functions-and-Variables-for-pictures"></a>
<a name="SEC199"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC198" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC200" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC196" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC196" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC201" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC314" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 48.3 Functions and Variables for pictures </h2>



<p><a name="Item_003a-make_005flevel_005fpicture"></a>
</p><dl>
<dt><u>Function:</u> <b>make_level_picture</b><i> (<var>data</var>)</i>
<a name="IDX1883"></a>
</dt>
<dt><u>Function:</u> <b>make_level_picture</b><i> (<var>data</var>,<var>width</var>,<var>height</var>)</i>
<a name="IDX1884"></a>
</dt>
<dd><p>Returns a levels <var>picture</var> object. <code>make_level_picture (<var>data</var>)</code>
builds the <var>picture</var> object from matrix <var>data</var>.
<code>make_level_picture (<var>data</var>,<var>width</var>,<var>height</var>)</code>
builds the object from a list of numbers; in this case, both the
<var>width</var> and the <var>height</var> must be given.
</p>
<p>The returned <var>picture</var> object contains the following 
four parts:
</p>
<ol>
<li> symbol <code>level</code>
</li><li> image width
</li><li> image height
</li><li> an integer array with pixel data ranging from 0 to 255.
Argument <var>data</var> must contain only numbers ranged from 0 to 255;
negative numbers are substituted by 0, and those which are
greater than 255 are set to 255.
</li></ol>

<p>Example:
</p>
<p>Level picture from matrix.
</p><pre class="example">(%i1) load(draw)$
(%i2) make_level_picture(matrix([3,2,5],[7,-9,3000]));
(%o2)         picture(level, 3, 2, {Array:  #(3 2 5 7 0 255)})
</pre>
<p>Level picture from numeric list.
</p><pre class="example">(%i1) load(draw)$
(%i2) make_level_picture([-2,0,54,%pi],2,2);
(%o2)            picture(level, 2, 2, {Array:  #(0 0 54 3)})
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-picturep"></a>
</p><dl>
<dt><u>Function:</u> <b>picturep</b><i> (<var>x</var>)</i>
<a name="IDX1885"></a>
</dt>
<dd><p>Returns <code>true</code> if the argument is a well formed image,
and <code>false</code> otherwise.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
 &middot;
@ref{Category: Predicate functions}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-picture_005fequalp"></a>
</p><dl>
<dt><u>Function:</u> <b>picture_equalp</b><i> (<var>x</var>,<var>y</var>)</i>
<a name="IDX1886"></a>
</dt>
<dd><p>Returns <code>true</code> in case of equal pictures, and <code>false</code> otherwise.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
 &middot;
@ref{Category: Predicate functions}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-make_005frgb_005fpicture"></a>
</p><dl>
<dt><u>Function:</u> <b>make_rgb_picture</b><i> (<var>redlevel</var>,<var>greenlevel</var>,<var>bluelevel</var>)</i>
<a name="IDX1887"></a>
</dt>
<dd><p>Returns an rgb-coloured <var>picture</var> object. All three arguments must
be levels picture; with red, green and blue levels.
</p>
<p>The returned <var>picture</var> object contains the following 
four parts:
</p>
<ol>
<li> symbol <code>rgb</code>
</li><li> image width
</li><li> image height
</li><li> an integer array of length <var>3*width*height</var> with pixel data ranging
from 0 to 255. Each pixel is represented by three consecutive numbers
(red, green, blue).
</li></ol>

<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) red: make_level_picture(matrix([3,2],[7,260]));
(%o2)           picture(level, 2, 2, {Array:  #(3 2 7 255)})
(%i3) green: make_level_picture(matrix([54,23],[73,-9]));
(%o3)           picture(level, 2, 2, {Array:  #(54 23 73 0)})
(%i4) blue: make_level_picture(matrix([123,82],[45,32.5698]));
(%o4)          picture(level, 2, 2, {Array:  #(123 82 45 33)})
(%i5) make_rgb_picture(red,green,blue);
(%o5) picture(rgb, 2, 2, 
              {Array:  #(3 54 123 2 23 82 7 73 45 255 0 33)})
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-take_005fchannel"></a>
</p><dl>
<dt><u>Function:</u> <b>take_channel</b><i> (<var>im</var>,<var>color</var>)</i>
<a name="IDX1888"></a>
</dt>
<dd><p>If argument <var>color</var> is <code>red</code>, <code>green</code> or <code>blue</code>,
function <code>take_channel</code> returns the corresponding color channel of
picture <var>im</var>.
Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) red: make_level_picture(matrix([3,2],[7,260]));
(%o2)           picture(level, 2, 2, {Array:  #(3 2 7 255)})
(%i3) green: make_level_picture(matrix([54,23],[73,-9]));
(%o3)           picture(level, 2, 2, {Array:  #(54 23 73 0)})
(%i4) blue: make_level_picture(matrix([123,82],[45,32.5698]));
(%o4)          picture(level, 2, 2, {Array:  #(123 82 45 33)})
(%i5) make_rgb_picture(red,green,blue);
(%o5) picture(rgb, 2, 2, 
              {Array:  #(3 54 123 2 23 82 7 73 45 255 0 33)})
(%i6) take_channel(%,'green);  /* simple quote!!! */
(%o6)           picture(level, 2, 2, {Array:  #(54 23 73 0)})
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-negative_005fpicture"></a>
</p><dl>
<dt><u>Function:</u> <b>negative_picture</b><i> (<var>pic</var>)</i>
<a name="IDX1889"></a>
</dt>
<dd><p>Returns the negative of a (<var>level</var> or <var>rgb</var>) picture.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>

</dd></dl>


<p><a name="Item_003a-rgb2level"></a>
</p><dl>
<dt><u>Function:</u> <b>rgb2level</b><i> (<var>pic</var>)</i>
<a name="IDX1890"></a>
</dt>
<dd><p>Transforms an <var>rgb</var> picture into a <var>level</var> one by
averaging the red, green and blue channels.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-get_005fpixel"></a>
</p><dl>
<dt><u>Function:</u> <b>get_pixel</b><i> (<var>pic</var>,<var>x</var>,<var>y</var>)</i>
<a name="IDX1891"></a>
</dt>
<dd><p>Returns pixel from picture. Coordinates <var>x</var> and <var>y</var> range from 0 to
<code>width-1</code> and <code>height-1</code>, respectively.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-read_005fxpm"></a>
</p><dl>
<dt><u>Function:</u> <b>read_xpm</b><i> (<var>xpm_file</var>)</i>
<a name="IDX1892"></a>
</dt>
<dd><p>Reads a file in xpm and returns a picture object.
</p>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>








<p><a name="Item_003a-Functions-and-Variables-for-worldmap"></a>
</p><hr size="6">
<a name="Functions-and-Variables-for-worldmap"></a>
<a name="SEC200"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC199" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC201" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC196" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC196" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC201" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC314" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 48.4 Functions and Variables for worldmap </h2>


<p><a name="Item_003a-region_005fboundaries"></a>
</p><dl>
<dt><u>Function:</u> <b>region_boundaries</b><i> (<var>x1</var>,<var>y1</var>,<var>x2</var>,<var>y2</var>)</i>
<a name="IDX1893"></a>
</dt>
<dd><p>Detects polygonal segments of global variable <code>boundaries_array</code>
contained in the rectangle with vertices (<var>x1</var>,<var>y1</var>) -upper left- 
and (<var>x2</var>,<var>y2</var>) -bottom right-.
</p>
<p>Example:
</p>
<p>Returns segment numbers for plotting southern Italy.
</p><pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) region_boundaries(10.4,41.5,20.7,35.4);
(%o3)                [1846, 1863, 1864, 1881, 1888, 1894]
(%i4) draw2d(geomap(%))$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-numbered_005fboundaries"></a>
</p><dl>
<dt><u>Function:</u> <b>numbered_boundaries</b><i> (<var>nlist</var>)</i>
<a name="IDX1894"></a>
</dt>
<dd><p>Draws a list of polygonal segments (boundaries), labeled by
its numbers (<code>boundaries_array</code> coordinates). This is of great
help when building new geographical entities.
</p>
<p>Example:
</p>
<p>Map of Europe labeling borders with their component number in
<code>boundaries_array</code>.
</p><pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) european_borders: 
           region_boundaries(-31.81,74.92,49.84,32.06)$
(%i4) numbered_boundaries(european_borders)$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-make_005fpolygon"></a>
</p><dl>
<dt><u>Function:</u> <b>make_polygon</b><i> (<var>nlist</var>)</i>
<a name="IDX1895"></a>
</dt>
<dd><p>Returns a <code>polygon</code> object from boundary indices. Argument
<var>nlist</var> is a list of components of <code>boundaries_array</code>.
</p>
<p>Example:
</p>
<p>Bhutan is defined by boundary numbers 171, 173
and 1143, so that <code>make_polygon([171,173,1143])</code>
appends arrays of coordinates <code>boundaries_array[171]</code>,
<code>boundaries_array[173]</code> and <code>boundaries_array[1143]</code> and 
returns a <code>polygon</code> object suited to be plotted by 
<code>draw</code>. To avoid an error message, arrays must be
compatible in the sense that any two consecutive
arrays have two coordinates in the extremes in common. In this
example, the two first components of <code>boundaries_array[171]</code> are
equal to the last two coordinates of <code>boundaries_array[173]</code>, and 
the two first of <code>boundaries_array[173]</code> are equal to the two first
of <code>boundaries_array[1143]</code>; in conclussion, boundary numbers
171, 173 and 1143 (in this order) are compatible and the colored 
polygon can be drawn.
</p><pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) Bhutan;
(%o3)                        [[171, 173, 1143]]
(%i4) boundaries_array[171];
(%o4) {Array:  
       #(88.750549 27.14727 88.806351 27.25305 88.901367 27.282221
         88.917877 27.321039)}
(%i5) boundaries_array[173];
(%o5) {Array:
       #(91.659554 27.76511 91.6008 27.66666 91.598022 27.62499
         91.631348 27.536381 91.765533 27.45694 91.775253 27.4161 
         92.007751 27.471939 92.11441 27.28583 92.015259 27.168051
         92.015533 27.08083 92.083313 27.02277 92.112183 26.920271
         92.069977 26.86194 91.997192 26.85194 91.915253 26.893881
         91.916924 26.85416 91.8358 26.863331 91.712479 26.799999 
         91.542191 26.80444 91.492188 26.87472 91.418854 26.873329
         91.371353 26.800831 91.307457 26.778049 90.682457 26.77417
         90.392197 26.903601 90.344131 26.894159 90.143044 26.75333
         89.98996 26.73583 89.841919 26.70138 89.618301 26.72694 
         89.636093 26.771111 89.360786 26.859989 89.22081 26.81472
         89.110237 26.829161 88.921631 26.98777 88.873016 26.95499
         88.867737 27.080549 88.843307 27.108601 88.750549 
         27.14727)}
(%i6) boundaries_array[1143];
(%o6) {Array:  
       #(91.659554 27.76511 91.666924 27.88888 91.65831 27.94805 
         91.338028 28.05249 91.314972 28.096661 91.108856 27.971109
         91.015808 27.97777 90.896927 28.05055 90.382462 28.07972
         90.396088 28.23555 90.366074 28.257771 89.996353 28.32333
         89.83165 28.24888 89.58609 28.139999 89.35997 27.87166 
         89.225517 27.795 89.125793 27.56749 88.971077 27.47361
         88.917877 27.321039)}
(%i7) Bhutan_polygon: make_polygon([171,173,1143])$
(%i8) draw2d(Bhutan_polygon)$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-make_005fpoly_005fcountry"></a>
</p><dl>
<dt><u>Function:</u> <b>make_poly_country</b><i> (<var>country_name</var>)</i>
<a name="IDX1896"></a>
</dt>
<dd><p>Makes the necessary polygons to draw a colored country.
If islands exist, one country can be defined with more than
just one polygon.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) make_poly_country(India)$
(%i4) apply(draw2d, %)$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>


<p><a name="Item_003a-make_005fpoly_005fcontinent"></a>
</p><dl>
<dt><u>Function:</u> <b>make_poly_continent</b><i> (<var>continent_name</var>)</i>
<a name="IDX1897"></a>
</dt>
<dt><u>Function:</u> <b>make_poly_continent</b><i> (<var>country_list</var>)</i>
<a name="IDX1898"></a>
</dt>
<dd><p>Makes the necessary polygons to draw a colored continent
or a list of countries.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) /* A continent */
      make_poly_continent(Africa)$
(%i4) apply(draw2d, %)$
(%i5) /* A list of countries */
      make_poly_continent([Germany,Denmark,Poland])$
(%i6) apply(draw2d, %)$
</pre>
<div class=categorybox>

&middot;
<p>@ref{Category: Package draw}
</p>
</div>


</dd></dl>







<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC196" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC201" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC314" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>root</em> on <em>July, 31 2008</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
